{
  "query": "Daymond John",
  "rendered_query": "\"Daymond John\"",
  "total_results": 10,
  "texts": [
    "Daymond John - Wikipedia Jump to content From Wikipedia, the free encyclopedia American businessman, investor, and television personality (born 1969) This article's lead section may be too short to adequately summarize the key points . Please consider expanding the lead to provide an accessible overview of all important aspects of the article. ( July 2025 ) Daymond John John in 2023 Born Daymond Garfield John ( 1969-02-23 ) February 23, 1969 (age 56) New York City, U.S. Occupations Businessman investor television personality author Known for founder and CEO   of FUBU Spouse Heather Taras ​ ( m. 2018) ​ Children 3 Website daymondjohn .com Daymond Garfield John [ 1 ] (born February 23, 1969) is an American businessman, investor, and television personality. He is an investor on the ABC reality television series Shark Tank . He is the founder, president, and chief executive officer of FUBU , and is the founder of The Shark Group. Early life [ edit ] John was born February 23, 1969, in Brooklyn , New York City, [ 2 ] but grew up in the Hollis neighborhood of Queens and attended Catholic school for seven years. [ 3 ] [ 4 ] He began working at the age of 10, when his parents divorced; one early job entailed handing out flyers for $2 ($8.38 in 2023) [ 5 ] an hour. [ 6 ] [ 7 ] In high school, he participated in a program that allowed him to work a full-time job and attend school on an alternating weekly basis, which he credits with instilling an entrepreneurial spirit. [ 8 ] After graduating from high school, he started a commuter van service and waited tables at Red Lobster . [ 3 ] [ 6 ] When John was 16, his mother had a boyfriend, an attorney, whom he considered a stepfather and mentor. [ 9 ] Career [ edit ] FUBU [ edit ] John started FUBU in his mother's house in Hollis, Queens . [ 10 ] When John first had the idea for a clothing company for young men, his mother taught him how to sew and supported him by allowing her house to be taken over to grow the business. [ 11 ] Wool ski hats with their tops tied off with fishing line were popular at the time, and John noticed them being sold for $20, which he considered overpriced. [ 12 ] He went home and sewed about 90 hats with his next-door neighbor. [ 13 ] They sold their homemade hats for $10 each on the corner of Jamaica Avenue and made $800 in a single day in 1992. [ 14 ] [ 15 ] After the hats, they began selling screen-printed T-shirts . To break into the market, they sold on consignment and at large events around the Northeast. [ 10 ] To make ends meet, John held a full-time job at Red Lobster , working on the FUBU business in between shifts. [ 16 ] In addition to Brown, he recruited longtime friends J. Alexander Martin and Keith Perrin into the business, and began sewing the FUBU logo onto hockey jerseys, sweatshirts, and T-shirts. [ 15 ] They loaned about 10 of the hockey jerseys out to rappers for their music videos for two years and got product placements in about 30 videos. [ 17 ] [ 18 ] John related that due to these placements, they were being perceived as a large and visible clothing brand, and stores started requesting their products. [ 10 ] In 1993, he convinced LL Cool J , an old neighborhood friend, to wear a FUBU T-shirt for a promotional campaign. [ 19 ] Later, while filming a 30-second advertising spot for The Gap , LL Cool J wore a FUBU hat in the commercial and incorporated the line \"for us, by us\" in his rapping. [ 16 ] [ 20 ] In 1994, John and his business partners received $300,000 in retailers' orders at the Las Vegas fashion trade show Magic . [ 10 ] Needing capital to make the products, John and his mother obtained a second mortgage on their house—a strategy John would later decline to recommend, as he had risked losing ownership of the house. [ 10 ] [ 17 ] After being turned down by 26 or 27 banks for a loan, his mother used the last of their money to take out an advertisement in The New York Times . [ 10 ] [ 17 ] As a result of the ad, FUBU made a deal with Samsung Textiles, allowing them to complete their orders. [ 10 ] [ 17 ] FUBU has earned over $6 billion in global sales. [ 21 ] FUBU is featured at the Smithsonian's National Museum of African-American History and Culture . [ 22 ] Shark Tank [ edit ] John and the sharks of Shark Tank in 2024. In 2009, John received a call from Mark Burnett asking him to join the cast of ABC's new reality business show Shark Tank , which gives entrepreneurs the opportunity to pitch their businesses to investors, or \"Sharks\" in the hopes of receiving an investment. As of early 2025, Shark Tank has run for 16 seasons. [ 23 ] John has invested $8,567,000 of his own money in Shark Tank companies as of May 12, 2017. [ 24 ] [ 25 ] [ 26 ] [ 27 ] His favorite investments on record by 2015 were Al \"Bubba\" Baker 's boneless ribs and Bombas socks. [ 28 ] Shark Tank has won 5 Emmy Awards and has been nominated 25 times. [ 29 ] The show won Outstanding Reality Program from 2012 to 2014. [ 30 ] On Season 5 of Shark Tank , John invested in Bubba's-Q Boneless Ribs on and helped grow the company from $154,000 in sales to $16 million in 3 years. [ 31 ] In 2017, Bubba's-Q Boneless Ribs partnered up with Carl's Jr. to create the limited-edition Baby Back Rib Burger. [ 31 ] In 2023, the LA Times published an article based on interviews with the Baker family, the owners of Bubba-Q's, where they expressed great dissatisfaction in dealing with John and his investment company. [ 32 ] A permanent restraining order was later issued against the Bakers by federal judge Robert B. Kugler , who found that they had violated a 2019 settlement agreement requiring all parties to work together and not air their disagreements publicly. [ 33 ] John also made a unique deal with 15-year-old Moziah \"Mo\" Bridges, owner of Mo's Bows. John decided not to invest in Mo's Bows but instead to mentor the young entrepreneur. [ 34 ] [ 35 ] The company would eventually take on a seven-figure licensing partnership with the NBA to create bow ties that use the teams' logos. [ 36 ] On Season 6 of the show, John invested in Bombas socks. For every pair of socks sold, the company donates a pair to someone in need. [ 37 ] [ 38 ] Following his investment, total sales for the company increased from $450,000 in the first nine months to $12 million. [ 39 ] As of May 2023, it is the best-selling Shark Tank product of all time, with $1.3 billion in cumulative sales according to Sony Pictures Television . [ 40 ] He also invested in Sun-Staches, which would subsequently make $4.2 million in sales. [ 31 ] [ 41 ] The Shark Group [ edit ] John is the CEO and founder of The Shark Group, a brand management and consulting firm. [ 42 ] The Shark Group has received four Webby Awards and a nomination for their work on Black Entrepreneurs Day . [ 43 ] [ 44 ] Consulting and speaking [ edit ] John has become a public speaker. [ 45 ] He is also a brand ambassador for the e-commerce company Shopify . [ 46 ] In 2021, he signed a deal with Audible. [ 47 ] Next Level Success [ edit ] In 2015, John co-founded Daymond John's Success Formula, a program designed to teach business owners and entrepreneurs how to start and grow their business. [ 48 ] In September 2019, Daymond John's Success Formula [ 49 ] rebranded to Next Level Success. [ 50 ] One of the organizations the program works with is the Network for Teaching Entrepreneurship . [ 51 ] The program offers a $1,500 scholarship to two students a year. This scholarship is given in hopes to inspire a new generation of entrepreneurs. Black Entrepreneurs Day [ edit ] John at Black Entrepreneurs Day in 2023. In 2020, Daymond John created and launched Black Entrepreneurs Day , an event aimed at promoting and encouraging entrepreneurship and black-owned business . [ 52 ] According to People , John got the idea for Black Entrepreneurs Day after considering how he could make change in the wake of the George Floyd protests , and to channel frustration over inequities into positive change, [ 52 ] as well as to \"celebrate\" black business owners. [ 53 ] The event is held at the Apollo Theater in Harlem . [ 53 ] It is held in partnership with the NAACP and corporate sponsors [ 52 ] and features black business owners and celebrities. [ 52 ] Other appearances [ edit ] In 2018 John appeared on Joey's World Tour, a YouTube channel devoted to fast food reviews. [ 54 ] In 2022, John competed in season eight of The Masked Singer as \"Fortune Teller\" who rode in a fortune teller machine -type vehicle. He was eliminated on \"TV Theme Night\" alongside Christopher Knight , Mike Lookinland , and Barry Williams as \"Mummies\". John was a guest narrator at Disney's Candlelight Processional from December 7–9, 2022. [ 55 ] Publications [ edit ] John has released five books: Display of Power , The Brand Within , The Power of Broke , Rise and Grind and 'Powershift'. Display of Power [ 56 ] is written by Daymond John with New York Times best-selling collaborator, Daniel Paisner . [ 57 ] Display of Power tells how four ordinary guys from Queens, New York, rose from street corners to corner offices and became the greatest trendsetters of their generation. [ 57 ] The Brand Within: The Power of Branding from Birth to the Boardroom (2010), [ 58 ] examines the loyalty relationships companies and celebrities seek to establish with their customers and fans, along with the identifying marks consumers carry when they buy into a brand or lifestyle. [ 59 ] The Power of Broke: How Empty Pockets, a Tight Budget, and a Hunger for Success Can Become Your Greatest Competitive Advantage was written by John in 2016. [ 60 ] John features various success stories from entrepreneurs such as Kevin Plank, Steve Aoki, Gigi Butler and Mo Bridges. [ 61 ] The Power of Broke appeared on the Wall Street Journal [ 61 ] and New York Times [ 62 ] bestseller lists, and received an NAACP Image Award for Outstanding Instructional Literary Work. [ 63 ] Rise and Grind: Outperform, Outwork, and Outhustle Your Way to a More Successful and Rewarding Life was released in January 2018. [ 64 ] Rise and Grind became a New York Times and Wall Street Journal best-seller. [ 65 ] [ 66 ] Little Daymond Learns to Earn was released in March 2023. Little Daymond became a New York Times best-seller. [ 67 ] Awards and recognition [ edit ] John is a New York Times and Wall Street Journal best-selling author. [ 68 ] [ 69 ] John has received numerous awards, including Brandweek Marketer of the Year, the NAACP Entrepreneurs of the Year Award (which he won twice), the Advertising Age Marketing 1000 Award for Outstanding Ad Campaign, the Essence Award, Crain's New York Business Forty Under Forty Award, Ernst & Young 's New York Entrepreneur of the Year Award, the Brandeis University International Business School's Asper Award for Excellence in Global Entrepreneurship, Details 50 Most Influential Men, and the Congressional Achievement Award for Entrepreneurship (which he won twice). [ 16 ] [ 24 ] [ 70 ] [ 71 ] [ 72 ] In 2015, President Obama appointed John to the Presidential Ambassadors for Global Entrepreneurship initiative to promote underserved entrepreneurs. [ 73 ] Bibliography [ edit ] Display of Power: How Fubu Changed a World of Fashion, Branding and Lifestyle (Naked Ink, 2007) ISBN 978-1595558534 The Brand Within: The Power of Branding from Birth to the Boardroom (Display of Power Publishing, 2010) ISBN 978-0982596210 The Power of Broke: How Empty Pockets, a Tight Budget, and a Hunger for Success Can Become Your Greatest Competitive Advantage , with Daniel Paisne (Crown Business, 2016) ISBN 978-1101903599 Rise and Grind: Outperform, Outwork, and Outhustle Your Way to a More Successful and Rewarding Life , with Daniel Paisne (Currency, 2018) ISBN 978-0804189958 Personal life [ edit ] John admitted that he was an absentee husband during his first marriage, telling a CNBC reporter that his wife \"literally saw me on TV more than she saw me in person\". [ 2 ] He attributed his absence from his wife and children to a combination of work and socializing. [ 2 ] In 2018, John married Heather Taras, his second wife, with whom he has a daughter. He has two daughters from his first marriage. [ 2 ] [ 74 ] [ 75 ] John is dyslexic . [ 76 ] In April 2017, John was diagnosed with stage II thyroid cancer . [ 77 ] John successfully underwent surgery to remove the cancerous nodule. John is Catholic . [ 78 ] [ 79 ] Philanthropy [ edit ] John is on the Board of Overseers and volunteer as a host or judge at NFTE events. [ 80 ] [ 81 ] NFTE is a global organization with chapters in 12 countries that teaches the value of entrepreneurship and core competencies to students in low income areas. [ 82 ] John has supported other efforts to encourage black entrepreneurship, including Barack Obama's My Brother's Keeper Challenge , [ 83 ] and he was involved in Michelle Obama 's college initiative on National Signing Day, celebrating high school students pursuing higher education, held at Temple University . [ 83 ] Louis Farrakhan comments [ edit ] On April 22, 2021, after attending the funeral for DMX , John posted a message to Twitter praising Louis Farrakhan , stating that the minister's speech was “powerful” and that his “deep understanding of the Bible and respect for other people’s religions was truly inspiring.” [ 84 ] John garnered instant backlash as people brought up Farrakhan's history of anti-Semitism and John immediately apologized and tweeted: \"In regards to my tweet regarding DMXs funeral, my comments on Minister Farrakhan were only related to what I just witnessed tonight, unbeknownst to his prior stances...As someone who was fortunate enough to have a step dad of the Jewish faith, I do not condone and never would condone any anti Semitic, prejudice or any remarks of hatred. The prior tweet will be removed to avoid further pain and confusion to anyone who has felt hurt in the past by any negative comments of his.\" He deleted his previous tweet. [ 84 ] Filmography [ edit ] Film and television appearances and roles Year Title Role Notes 2005 The Crow: Wicked Prayer Proud Foot Joe [ 85 ] 2009–present Shark Tank Himself Shark [ 86 ] 2014 What Would You Do? Himself Season 9 , episode 1 [ 87 ] Sharknado 2: The Second One Wall Street Man [ 88 ] 2016 To Tell the Truth Himself Season 1, episode 6 [ 89 ] The $100,000 Pyramid Himself Season 1, episode 6 [ 90 ] Dr. Ken Himself Season 2, episode 7 [ 91 ] 2018 All About the Washingtons Himself Season 1, episode 1 [ 92 ] 2020 Billions Himself Season 5 , episode 4 [ 93 ] Ridiculousness Himself Season 16 , episode 31 [ 94 ] 2021 Wahl Street Himself 5 episodes [ 95 ] 2022 Celebrity Family Feud Himself Season 9 , episode 9 [ 96 ] The Masked Singer Fortune Teller Eliminated in Season 8 , episode 3 [ 97 ] 2023 Black Ink Crew Himself Season 10 , episode 14 [ 98 ] The Eric Andre Show Himself Season 6 , Episode 10 [ 99 ] Wild 'n Out Himself Season 19 , episode 17 [ 100 ] 2024 Ridiculousness Himself Season 39 , episode 5-",
    "Daymond John\n – DaymondJohn.com Skip to content Your cart is empty Continue shopping Have an account? Log in to check out faster. Courses Courses Your cart Loading... Order special instructions Order special instructions Subtotal $0.00 USD Taxes and shipping calculated at checkout Update Check out ENTREPRENEUR Daymond John has come a long way from turning a $40 budget into FUBU, a $6 billion fashion game-changer. Throughout his career, Daymond has continued to be an entrepreneur in every sense of the word. He is not only a pioneer in the fashion industry but a Shark on the 4-time Emmy Award winning Shark Tank, a New York Times best-selling author, branding guru, and highly sought-after motivational speaker. As a passionate advocate for entrepreneurship, Daymond is committed to motivating and educating the next generation of aspiring entrepreneurs on the merits of ingeniousness, hard work and determination required for success. SHARK Over the past 14 seasons of Shark Tank, Daymond has invested in over 30 brands across various industries including food & beverage, beauty & wellness, fashion and more. He remains committed to helping ambitious entrepreneurs get their businesses off the ground. Over the past 14 seasons of Shark Tank, Daymond has invested in over 30 brands across various industries including food & beverage, beauty & wellness, fashion and more. He remains committed to helping ambitious entrepreneurs get their businesses off the ground. BRAND AMBASSADOR Brands have the opportunity to collaborate with Daymond on a multitude of levels including press & media, live broadcasts, and custom branded content creation to amplify their messaging and position themselves as an innovative brand. Brands have the opportunity to collaborate with Daymond on a multitude of levels including press & media, live broadcasts, and custom branded content creation to amplify their messaging and position themselves as an innovative brand. WORK WITH DAYMOND SPEAKER As a motivational speaker, Daymond's quintessential rags-to-riches success story of sacrifice, hard work, and perseverance as well as the unique and charismatic way he communicates it, will inspire any audience. As a motivational speaker, Daymond's quintessential rags-to-riches success story of sacrifice, hard work, and perseverance as well as the unique and charismatic way he communicates it, will inspire any audience. HIRE DAYMOND TO SPEAK Featured BLOG POSTS View all The Art of the Pivot: When and How to Change Your Business Direction Let me tell you something a lot of people don’t like to admit:Sometimes the path you’re on… isn’t the one that’s going to take you where you want to go.... The Art of the Pivot: When and How to Change Your Business Direction Let me tell you something a lot of people don’t like to admit:Sometimes the path you’re on… isn’t the one that’s going to take you where you want to go.... Mentorship Matters: How Guiding Others Can Also Grow Your Business One of the biggest misconceptions in business is that mentorship is a one-way street. That it’s only about giving. That it’s something you do after you’ve “made it.” That’s not... Mentorship Matters: How Guiding Others Can Also Grow Your Business One of the biggest misconceptions in business is that mentorship is a one-way street. That it’s only about giving. That it’s something you do after you’ve “made it.” That’s not... Sustainable Practices: Integrating Eco-Friendly Measures into Your Business Model Let’s be real—“going green” used to feel like a buzzword.Now? It’s a business necessity. I’m not just talking about being trendy. I’m talking about creating a brand that lasts. One... Sustainable Practices: Integrating Eco-Friendly Measures into Your Business Model Let’s be real—“going green” used to feel like a buzzword.Now? It’s a business necessity. I’m not just talking about being trendy. I’m talking about creating a brand that lasts. One... 1 / of 3 View all FOLLOW DAYMOND ON SOCIAL MEDIA Featured Partners Choosing a selection results in a full page refresh. Opens in a new window.",
    "Daymond John (@thesharkdaymond) • Instagram photos and videos",
    "Daymond John",
    "Daymond John - CEO of FUBU and The Shark Group, TV Personality on ABC Shark Tank, Public Speaker | LinkedIn Skip to main content Sign in to view Daymond’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Daymond John Sign in to view Daymond’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . CEO of FUBU and The Shark Group, TV Personality on ABC Shark Tank, Public Speaker New York, New York, United States Contact Info Sign in to view Daymond’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . 3M followers 500+ connections See your mutual connections View mutual connections with Daymond Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Join to view profile Message Sign in to view Daymond’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . ABC Television FUBU Foundation Websites Personal Website http://www.daymondjohn.com Book a Meeting http://www.gamechangermeetings.com Business Advancement www.daymondondemand.com Report this profile About From humble beginnings to a self-made multimillionaire with over $6 billion to date in global product sales and a starring role on ABC’s newest business reality TV show, Shark Tank, Daymond John is the personification of the American Dream. He continues to set standards of excellence while expanding his interests in fashion, branding, marketing, consulting, entertainment, and beyond. This industry leader, best-selling author, and ground breaking entrepreneurial expert has evolved into a highly sought after business and motivational speaker. As a dynamic business speaker with over twenty years of hands-on proven business experience, Daymond shares the strategies that continue to bring him financial success. As Founder and CEO, Daymond steered FUBU from a mere concept to a global fashion powerhouse with annual retail sales exceeding $350 million at its peak. Utilizing many of the same tactics commonly used today, Daymond John pioneered the art of integrating fashion, culture, and music nearly twenty years ago. From his then unprecedented guerrilla marketing and branding techniques to the continuously innovative ways in which he uses social media, brand integration, and his expertise on pop culture, Daymond remains a cutting edge business strategist. Daymond teaches audience members how to apply his successful methods to a wide range of businesses today. He shares winning tips for negotiating and negotiating for women, boosting sales, improving employee morale, increasing productivity, and optimizing staff talents. As a motivational speaker, Daymond’s quintessential rags-to-riches success story of sacrifice, hard work, and perseverance as well as the unique and charismatic way he communicates it, will inspire any audience. Specialties: •\tBusiness Strategy •\tInternational Business Branding •\tBranding Expert •\tCelebrity Alignment •\tBrand Development •\tBrand Management •\tNational & International C-Suite Consulting •\tDesigner •\tMarketing •\tMotivational Speaker •\tAuthor Articles by Daymond Entrepreneurship is a Team Sport Oct 22, 2020 Entrepreneurship is a Team Sport Life is a series of mentors. If you’ve followed me for some time, you know I talk a lot about the importance of… 4,069 351 Comments What is Daymond John's Power of Broke? Dec 18, 2015 What is Daymond John's Power of Broke? You may have seen me talking about this concept I call “THE POWER OF BROKE” on my social media feeds for a while now… 2,953 400 Comments What Every Entrepreneur Must Know To Succeed In Business Dec 3, 2015 What Every Entrepreneur Must Know To Succeed In Business People ask me all the time what is the one piece of advice I have for starting a business. My answer is that there is… 4,197 543 Comments What I Have Learned In My Seven Years As A Shark Nov 24, 2015 What I Have Learned In My Seven Years As A Shark Things have changed quite a bit since I entered the first season of Shark Tank. One thing that is very exciting to me… 1,807 269 Comments Here’s What I Plan to Do With My Presidential Appointment Jun 25, 2015 Here’s What I Plan to Do With My Presidential Appointment My mother always told me to dream big. It's those of us who have the audacity to dream and the vision to see beyond… 1,003 240 Comments Show more See all articles Activity Follow Sign in to view Daymond’s full profile Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . The @aflac team thought they were signing up for a sales retreat… but I brought them fishing instead. \nBecause sometimes business lessons don’t… The @aflac team thought they were signing up for a sales retreat… but I brought them fishing instead. \nBecause sometimes business lessons don’t… Shared by Daymond John Results don’t lie.\n\nIn my latest episode of Mick Unplugged, I sat down with Mr. Wonderful himself, Kevin O'Leary .\n\nWe talked about what it really… Results don’t lie.\n\nIn my latest episode of Mick Unplugged, I sat down with Mr. Wonderful himself, Kevin O'Leary .\n\nWe talked about what it really… Liked by Daymond John In my 20s, I cut the negative people out of my life. My whole world changed. I started a business and grew it to something the world would know named… In my 20s, I cut the negative people out of my life. My whole world changed. I started a business and grew it to something the world would know named… Shared by Daymond John Join now to see all activity Experience TV Personality on \"Shark Tank\" ABC Television 2009 - Present 16 years \"Shark Tank\" is a business reality television series by acclaimed TV producer Mark Burnett (Survivor, The Apprentice) that airs on ABC Network. As one of the “Sharks,” Daymond John, and four other prominent executives, listen to business pitches from everyday people who hope to launch their company or product to new heights. Investing his own money in every project, Daymond John becomes partners with the entrepreneurs and helps them turn their aspirations into a reality. Millions of viewers… Show more \"Shark Tank\" is a business reality television series by acclaimed TV producer Mark Burnett (Survivor, The Apprentice) that airs on ABC Network. As one of the “Sharks,” Daymond John, and four other prominent executives, listen to business pitches from everyday people who hope to launch their company or product to new heights. Investing his own money in every project, Daymond John becomes partners with the entrepreneurs and helps them turn their aspirations into a reality. Millions of viewers tune into the show as John demonstrates his marketing prowess and entrepreneurial insights. Show less CEO | Branding Expert The Shark Group 2009 - Present 16 years New York, United States In a world saturated with marketing and advertising companies, The Shark Group distinguishes itself through non-traditional and innovative approaches in raising product awareness, while engaging the target audience and stirring emotion in consumers through entertainment. Our integration techniques will elevate your product's status to new heights as we communicate your company's core message in a completely new fashion. We pride ourselves in strong client relationships and partnerships… Show more In a world saturated with marketing and advertising companies, The Shark Group distinguishes itself through non-traditional and innovative approaches in raising product awareness, while engaging the target audience and stirring emotion in consumers through entertainment. Our integration techniques will elevate your product's status to new heights as we communicate your company's core message in a completely new fashion. We pride ourselves in strong client relationships and partnerships in order to not only meet our clients' goals, but to exceed them. Show less CEO & Founder FUBU 1992 - Present 33 years The company was founded in 1992 by Daymond John with a line of hats made in his house in Hollis, Queens, New York. According to the company website, John mortgaged his own home for $100,000 and with that seed money he and his three friends Carl Brown, J. Alexander Martin, and Keith Perrin, turned half of his house into a factory and the other half into living space. Branding Expert | Business Strategist | Venture Capitalist | Investor Daymond John Jan 1992 - Jan 2011 19 years 1 month Education FUBU Foundation - None - Skills Company Branding Branding Personal Branding Consulting Business Strategy International Business Branding Branding Expert Author Motivational Speaker Designer Marketing Celebrity Alignment Brand Development Brand Management National & International C-Suite Consulting Show 3 more skills Show fewer skills More activity by Daymond The skilled trades are having a renaissance and the collision repair industry is leading the way. Our Founder & CEO, Matt Ebert, recently joined… The skilled trades are having a renaissance and the collision repair industry is leading the way. Our Founder & CEO, Matt Ebert, recently joined… Liked by Daymond John MY BIOHACKING BROKE THE INTERNET\nor at least that's what I tell my friends and definitely my enemies. \n\nIf you didn't see my interview last week… MY BIOHACKING BROKE THE INTERNET\nor at least that's what I tell my friends and definitely my enemies. \n\nIf you didn't see my interview last week… Shared by Daymond John Shout out to Dads!\nTo all of those that can say their Father….. Or Mother was a huge inspiration on why they are the person they are today… Shout out to Dads!\nTo all of those that can say their Father….. Or Mother was a huge inspiration on why they are the person they are today… Shared by Daymond John Incredible energy Google #ThinkGlobalNYC Event.  If you want massive success, you have to think globally and cannot have a one-size fits all… Incredible energy Google #ThinkGlobalNYC Event.  If you want massive success, you have to think globally and cannot have a one-size fits all… Shared by Daymond John I’m back on the road starting today.\n \nYou’re not going to want to miss my tour dates! \nHit me up if l’m in a city near you… I’m back on the road starting today.\n \nYou’re not going to want to miss my tour dates! \nHit me up if l’m in a city near you… Shared by Daymond John View Daymond’s full profile See who you know in common Get introduced Contact Daymond directly Join to view full profile Sign in Stay updated on your professional world Sign in By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now Other similar profiles Reese W. Reese W. New York, NY Connect Neil Levine Neil Levine New York City Metropolitan Area Connect Wamiq Jawaid Wamiq Jawaid New York, NY Connect Stephan Fortier Stephan Fortier Miami, FL Connect Rich Daughtridge Rich Daughtridge Hagerstown, MD Connect Jennifer Brown Jennifer Brown Founder/CEO @ Westside Digital Group | Influencer Management, Marketing Communications Los Angeles, CA Connect Chelli Wolford Chelli Wolford Salt Lake City, UT Connect Eyal Simko Eyal Simko CEO at The One Up Group + Virtual Cr8tive Los Angeles, CA Connect Michael Libby Michael Libby Los Angeles, CA Connect Explore more posts William \"Todd\" Mason There's no such thing as a \"simple\" live entertainment event. \n\nWhether it's a movie premiere, experiential event, or companion show during the Emmys, live entertainment productions come with one universal truth: you don't get a second take.\n\nAfter 20+ years of producing these events–on red carpets, in stadiums, aboard yachts, and even from our Network Operations Center–I've learned a few lessons the had way. \n\nSome of the most important?\n\n✔️Bring in your production partner early (they'll save you time, money, and stress)\n\n✔️ Understand the venue inside and out (before you book it)\n\n✔️ Don't assume the venue WIFI is going to work (ever)\n\n✔️ Know when to go REMI vs. fully on-site or a mix of both\n\n✔️Work with teams who own their gear and know exactly how to use it\n\nI broke it all down in my latest blog, using real examples from some of our most complex shows. \n\nRead it here: https://hubs.la/Q03tqfPY0\n\nIf you're planning an upcoming event, this is the kind of experience that can save your show. \n\n#LiveProduction #EntertainmentEvents #EventProduction 48 3 Comments Tim van Rongen Awards like the Grammys, Oscars, and MTV Awards have lost their cultural relevance for younger audiences. Today’s generation isn’t tuning in—they're creating, curating, and engaging on their own terms. The era of mass broadcast prestige is fading, replaced by decentralized, fan-driven recognition. Legacy awards remain an industry in-crowd event, while real influence happens in digital spaces where audiences dictate what matters, not outdated institutions! 38 5 Comments Elen Orleans This past weekend, I had the chance to attend the Lady Filmmakers Festival, an event dedicated to celebrating and empowering women in film. On Sept 28, I watched a block of short films and was blown away by the creativity, vision, and bold storytelling of the female filmmakers who showcased their work.\nBeyond the screenings, I joined a panel with producers who shared practical advice for indie, fir",
    "TikTok - Make Your Day",
    "Reddit - The heart of the internet Skip to main content Go to IAmA r/IAmA r/IAmA I Am A, where the mundane becomes fascinating and the outrageous suddenly seems normal. Members • TheSharkDaymond 繁體中文 简体中文 Suomi Türkçe Filipino Español (España) Español Polski Italiano 한국어 I’m entrepreneur Daymond John. I’m a Shark on ABC’s Shark Tank, a Pisces, a Hot Sauce connoisseur, and an animal advocate. Today I’m talking about how you can RISE AND GRIND. Ask me anything! Business I'm Daymond John, co-star on ABC’s Shark Tank, Founder and CEO of the fashion brand FUBU, author of NYT Best Seller The Power of Broke and my newest book, Rise And Grind. As CEO of the firm The Shark Group, I’m an investor, consultant, mentor to brands, businesses, entrepreneurs, executives, and celebrities all over the world. https://daymondjohn.com/ Proof: https://i.redd.it/cbsd5fz133b01.jpg Read more Archived post. New comments cannot be posted and votes cannot be cast. Share Top Posts Reddit reReddit: Top posts of January 22, 2018 Reddit reReddit: Top posts of January 2018 Reddit reReddit: Top posts of 2018 Reddit Rules Privacy Policy User Agreement Accessibility Reddit, Inc. © 2025. All rights reserved. Expand Navigation Collapse Navigation",
    "Daymond John, Entrepreneur - Yale Dyslexia By Sue Glader These days, Daymond John might be best known as one of the five savvy business executives (known as the “sharks”) who quickly mull over whether to invest their own money in the business ideas that budding entrepreneurs anxiously illustrate on the ABC hit television show Shark Tank . But it was his entrepreneurial instincts and expertise that launched his influential clothing line FUBU and built his stellar reputation, with awards such as Ernst & Young’s New York Entrepreneur of the Year and Crain’s Business of New York Under Forty Award. This success may not have been possible if John had let his difficulty with dyslexia define him. Instead, he used his strengths to get ahead. John has known since he was a young boy in Hollis, Queens, New York, exactly where his mastery lies: the intersection of creative and analytical thinking. These skills led him in the early 1990s to define the urban apparel market with a company he named FUBU (For Us By Us). It all started with John’s sewing simple tie-top hats out of his childhood home for $10 apiece, gained momentum when neighborhood friend and hip-hop singer LL Cool J wore a FUBU hat in a Gap commercial, and took off when John managed to broker a distribution deal with Samsung. FUBU enjoyed annual sales of $350 million in 1998 and launched John as a savvy entrepreneur, branding expert, and “Godfather of Urban Fashion.” Before he became the influential entrepreneur that he is today, John had to get through school. “In math and science, I would excel,” says John. “I could look at something quickly and get high grades, A’s and B’s.” Yet reading and spelling were another story. His father’s frustration turned to yelling and worse when John couldn’t get certain words, no matter how often the two would study them. “Literally, I couldn’t spell the word ‘because’ for 4 or 5 years. I wouldn’t know how to spell my middle name, Garfield. When I read a book, I got tired.” He was a C or D student in language arts, even though he spent far more time working on it. But when his struggles in school finally brought him to see a professional, the diagnosis of a learning/ behavioral issue didn’t sit well with his mother. “My mother didn’t believe it,” he remembers. “She just said I wasn’t applying myself. She felt I was brilliant, because she would work with me on a daily basis and see my abilities.” John’s point of view in school was simple. He knew he wasn’t good at reading, but math and science and everything else came easily. So he worked hard to be exceptional “and look like a superstar” where he could, and was content to squeak by when it came to reading and writing. The key, it seems, was that he never let his one area of weakness define his whole self. “My mother always said, ‘It takes the same energy to think small as it does to think big,’” John says. “So dream big and think bigger.” John did think analytically about what kind of student he was. “You always have to know where you’re weak and where you’re strong,” John explains, in business and in life. So for high school, he chose a program where his challenges wouldn’t hurt him. The answer was Bayside High School’s co-op program, where students worked full-time one week and went to school the next. John’s time working at First Boston enabled him to make money, spend time in the city putting his finger on the pulse of everything cool, gain valuable work experience, all while cutting his school work in half. “I have this attitude about any challenges you have in life,” John says. “You highlight it, address it, and then find out how to work around it. Figure out how to live with it.” “I always thought I was a genius,” he says today, without a hint of pretense and a track record to back up this statement. Ten years ago, when texting and emails started being an accepted way of communicating on a daily basis, John came face-to-face with the impact his terrible spelling had on how people perceived him. Then when he went through media training and was introduced to the scrolling visual text of a teleprompter, he couldn’t master it. Suddenly the 30-year-old highly successful business executive began questioning himself. What was the problem, he wondered? It all came together when a friend pointed out that whenever the navigation system in a car would say turn left, John would turn right. Or when looking for a hotel room 118, and the sign would say Rooms 115–120 to the right, John would always go to the left and not realize his error until the end of the hallway. John combined those data points with the issues from his childhood and the amorphous “learning issue” diagnosis and it all made sense: dyslexia. Reading today still takes John far longer than someone who doesn’t struggle with dyslexia, and he will often pass off documents to one of his colleagues for confirmation. “Everyone knows my situation. I say, ‘Break this down for me and let me know if I’m reading this factually.’” Despite being keenly aware of his dyslexia, Daymond John’s drive and determination to effectively translate his insights into entrepreneurship, marketing and branding have led him to be an in-demand motivational speaker as well as the author of two successful books, Display of Power and The Brand Within . For a kid who struggled so much with the written word, this is something of which he is very proud. “My mother always said, ‘It takes the same energy to think small as it does to think big,’” John says. “So dream big and think bigger.” Related Nancy Brinker, Founder of Susan G. Komen for the Cure Nancy Brinker is perhaps best known as the founder of the Susan G. Komen Breast Cancer Foundation, now known as Susan G. Komen for the Cure. But that is only one of her many accomplishments. Brinker has also served as U.S. ambassador to Hungary and as White House Chief of Protocol and is currently the Goodwill Ambassador for Cancer Control for the United Nations World Health Organization. Read More Tom Cavanaugh, Entrepreneur Tom Cavanaugh was 71 before he saw his true reflection—not in a mirror—but in a movie.  There he was, at 17, in a scene showing a high school student completely lost looking for his hallway locker, and then spinning the combination lock repeatedly, without result. Read More Ari Emanuel, Co-Chief Executive of William Morris Endeavor Entertainment Emanuel learned at an early age to be aggressive and stand up for himself. Raised in a family where education was a high priority, he had to read the newspaper every day to keep up with current events and defend his political opinions each night at the family dinner table. This posed no problem for his brother Rahm, former Obama chief of staff and now Chicago mayor, and Ezekiel, a breast oncologist and head of the Department of Bioethics at the Clinical Center of the National Institutes of Health. But for Emanuel, diagnosed in the third grade with dyslexia and ADHD, it was a monumental challenge. “I was on the ceiling,” he says. “The Ritalin helped, but reading was an enormous task.” Read More Steve Mariotti, Founder & Former President of the Network for Teaching Entrepreneursh.. Mariotti, who dedicates over eighty hours a week to NFTE, learned the importance of persistence and hard work at an early age, when he was diagnosed with dyslexia. He struggled with reading, mispronounced similar sounds, and was unable to alphabetize. Read More Scroll to Top",
    "Reddit - The heart of the internet Skip to main content Go to Entrepreneur r/Entrepreneur • ejexe हिन्दी Português (Brasil) 繁體中文 Español (Latinoamérica) বাংলা ไทย Español Bahasa Melayu Português (Portugal) Italiano Türkçe Nederlands My review of Daymond John's Launch Academy (ugh)... Hey guys, my name is EJ.  I did a review on Youtube also, if you don't want to read all of this.  You can check it out here! I recently got some tickets in the mail for Daymond John's Launch Academy.  I am an entrepreneur and the event was right down the street from my house, so I did some research on Daymond John and decided it would be AWESOME to meet him or even just to see him live.  So I called and immediately registered to the event. I was excited to go, so it seemed like it took forever for the day to get here, but it finally did and I headed out.  I was still excited when I got to the venue, so I signed in and waited for the doors to open! Went inside, sat down, and had to wait another 15 minutes before someone started talking.  After a 5-10 minute introduction, the guy says that Daymond John won't be there.  What the fuck? So they have some other guy (idk who he was) come up and talk.  He talked about very basic, common sense business stuff for about 15 minutes before he brings up a 3 day weekend seminar that Daymond John will actually be at, but guess what?  It costs $4000.  Keep in mind that this was a week before Christmas. Then he mentions that Daymond John will give a scholarship to anyone at the event I am at!  So I get excited again!  And then he explains that it is not a full scholarship, it is \"only $997 for today only\" (law of scarcity, bullshit sales technique).  The guy was VERY aggressive in trying to sell this weekend, at one point he asked who was interested but couldn't afford to pay.  Then he proceeded to TELL them to get up.  He told people to borrow money to pay for it.  Again, this is a week before Christmas in a lower-middle class neighborhood. If I had  $997 bucks to blow on a ridiculous 2-bit salesman, my business wouldn't need fixing. Basically, the last hour and a half of the seminar was 90% talking about how great the 3 day seminar would be, and how you NEED to sign up now, and 10% was devoted to more elementary level business shit.  It was ridiculous. I suggest not going.  I mean, it is really up to you, but I left there very angry that they wasted my time.  There was little evidence that Daymond John was even involved with the seminar (mostly hearsay, the guy talking said Daymond was his friend, and they had some Youtube videos of Daymond in the presentation). TL;DR, Check out my review on Youtube if you dont feel like reading. Thanks for reading/watching! Read more Share Top Posts Reddit reReddit: Top posts of December 21, 2015 Reddit reReddit: Top posts of December 2015 Reddit reReddit: Top posts of 2015 Reddit Rules Privacy Policy User Agreement Accessibility Reddit, Inc. © 2025. All rights reserved. Expand Navigation Collapse Navigation",
    "Daymond John: Rise and Grind Habits for a Successful Business and Life EP. 598 02/05/18 Daymond John “This year I’m really looking forward to acquiring more dad jokes.” Listen on Apple Podcasts Listen on Spotify Listen on Amazon Music Watch & Listen on YouTube Today you’re in for a real treat. I interviewed a friend of mine, and king of dad jokes, Daymond John. He was telling so many dad jokes that had me rolling, I didn’t even think we were going to be able to record the interview. Not only that, but he is an amazing businessman with great insights anyone can use. If you’ve ever wondered how to become an entrepreneur, how to get started in investing, and how to balance your work and family life, you’ll love Daymond’s perspective. On this episode of The School of Greatness, Daymond shares the most important things he’s learned from the most successful people ever. One of the biggest things is one we all neglect: our health. By taking on the lessons that he shares in his newest book Rise and Grind , Daymond learned to listen to his body and discovered cancer in his throat. Daymond is a truly remarkable man who has started from the ground up and is constantly learning and changing his game to adapt not only to the world around but also to how he himself is changing all the time. “If you’re going to operate a business, it needs to be something that’s like Christmas every single day.” Share: Daymond is the CEO and Founder of FUBU, a famous lifestyle brand, and a pioneer in the fashion industry with over $6 billion in product sales. He is an award-winning entrepreneur, and his marketing strategies and ability to build successful brands has made him a highly influential consultant and motivational speaker today. In 2009, he joined the cast of ABC entrepreneurial business show Shark Tank by acclaimed producer Mark Burnett. Shark Tank has been such a success, it’s now on its 10th season! Get ready to take notes from Daymond’s insights on Episode 598 . Some Questions I Ask: Who has been the most inspiring person to come on the show? (10:02) What is the greatest negotiation you’ve ever done? (12:40) Do you feel like you have more balance for family life now? (17:38) When did you have surgery for your cancer? (23:08) Do you have any insecurities? (25:46) How do you choose what opportunities to take on? (28:17) What is the 20% that provides 80% of your revenue? (30:22) What is the thing that you are most excited about right now? (32:58) What’s the thing that pulls are your heart the most? (36:04) Do you think about running your family like a business? (37:53) Why do you think entrepreneurs aren’t as willing to have discussions with their significant others as they are a business partner? (39:54) What is your unique superpower? (45:27) Do you schedule everything in the book every day for you? (48:00) In this episode, you will learn: The most important element to Shark Tank (8:55) The biggest lesson Daymond learned about himself over the last 10 seasons (11:53) How having a child shifted his views of business (15:25) The big things people taught him about continuing to master his skills (19:17) Daymond’s daily schedule for health (24:29) How he decides which causes to support (27:23) The one thing he can do this year to increase his revenue (29:32) What his new podcast is based on (32:03) The thing Daymond is most proud of (34:55) The most painful thing in Daymond’s life (36:24) What he sees as a great opportunity to get into (42:16) The thing Daymond looks for when he picks people (46:16) Plus much more… Show Notes: Rise and Grind: Outperform, Outwork, and Outhustle Your Way to a More Successful and Rewarding Life Daymond’s Rise and Grind Podcast Crushing it by Gary V 7 Habits of Highly Effective People by Steven R Covey Connect with: Daymond John Visit Website The School of Greatness Show The School of Greatness shares inspiring interviews from the most successful people on the planet—world-renowned leaders in business, entertainment, sports, science, health, and literature—to inspire YOU to unlock your inner greatness and live your best life. Listen on Apple Podcasts Listen on Spotify Listen on Amazon Music Watch & Listen on YouTube Similar Episodes All Episodes Lewis Howes and Matthew Cesaratto 8 Ways to Be Calm and Prepared During Crisis Lewis Howes How To Stay Patient (When You’re Not Successful Yet) The Key to Abundance and Success Lewis Howes The 7 Ways You Can Give to Others (For FREE) Steve Cook Beyond the Body: What Makes a Real Man Rob Bell The Spiritual Guide to Inner Peace, Mastering Grief, & Understanding God How an Ordinary Person Can Create Extraordinary Change Lewis Howes 4 Ways to Stay Positive When You Feel Overwhelmed Sara Blakely SPANX CEO on Writing Your Billion Dollar Story Jason Silva How to Be a True Billionaire We use Cookies 🍪 To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
  ],
  "links": [
    "https://en.wikipedia.org/wiki/Daymond_John",
    "https://daymondjohn.com/",
    "https://www.instagram.com/thesharkdaymond/?hl=en",
    "https://www.facebook.com/TheSharkDaymond/",
    "https://www.linkedin.com/in/daymondjohn",
    "https://www.tiktok.com/@thesharkdaymond?lang=en",
    "https://www.reddit.com/r/IAmA/comments/7s8wup/im_entrepreneur_daymond_john_im_a_shark_on_abcs/",
    "https://dyslexia.yale.edu/story/daymond-john/",
    "https://www.reddit.com/r/Entrepreneur/comments/3xr3oa/my_review_of_daymond_johns_launch_academy_ugh/",
    "https://lewishowes.com/podcast/e-daymond-john-rise-grind-habits-successful-business-life/"
  ]
}