{
  "query": "James Sinegal",
  "rendered_query": "\"James Sinegal\"",
  "total_results": 10,
  "texts": [
    "James Sinegal - Wikipedia Jump to content From Wikipedia, the free encyclopedia American businessman James Sinegal James Sinegal in 2013 Born James D. Sinegal ( 1936-01-01 ) January 1, 1936 (age 89) Pittsburgh, Pennsylvania , U.S. Education San Diego City College ( AA ) San Diego State University ( BA ) Occupation(s) Retired businessman and retail executive Known for Co-founder and former CEO of Costco Successor W. Craig Jelinek Spouse Janet Sinegal Children 3 James D. Sinegal (born January 1, 1936) is an American businessman, co-founder and former CEO of the Costco Wholesale Corporation, [ 1 ] an international retail chain. He served as Costco's president and CEO from 1983 until 2011. As CEO of Costco, Sinegal was known for his hands-on humanitarian approach to business. He prioritized customer and employee satisfaction over shareholder interests and is also known for his philanthropic efforts. Early life and education [ edit ] James D. Sinegal was born on January 1, 1936 into a Catholic working-class family in Pittsburgh, Pennsylvania . He attended St. Lawrence O'Toole primary school, Central Catholic High School (Pittsburgh) , and Helix High School in La Mesa, California , [ 2 ] and he earned an AA at San Diego City College in 1955. [ 2 ] He attended San Diego State University , [ 3 ] graduating with a Bachelor of Arts degree in 1959. [ 4 ] Career [ edit ] After Sinegal started as a grocery bagger at FedMart in 1955, he discovered that he loved the retail industry, and he was excited by the opportunities at this rapidly growing retailer. At FedMart, he worked his way up to executive vice president in charge of merchandising and operations. He was a vice president of merchandising for Builders Emporium from 1977 to 1978 and an executive vice president for the Price Company from 1978 to 1979. From 1979 to 1983, he worked with Sinegal/Chamberlin and Associates, a company that acted as a broker and sales representative for food and nonfood products. Together with Seattle retailer Jeff Brotman , he co-founded Costco. From 1983 until his retirement in 2011, Sinegal served as Costco's president and CEO. [ 1 ] As CEO, Sinegal was well known for traveling to each Costco location every year to inspect it personally. Sinegal's innovations made Costco the first \"warehouse club\" to include fresh food, eye-care clinics, pharmacies, and gas stations in its mix of goods and services. [ 3 ] Sinegal was a protégé of Sol Price , widely considered to be the \"father\" [ 5 ] of the \" warehouse club \" concept. Most if not all of Sinegal's business philosophy can be attributed to Price; Sinegal has said that he \"learned everything\" from Price. [ 6 ] Sinegal is known for a benevolent style of management rooted in the belief that employees who are treated well will in turn treat and serve customers well. Sinegal, through Costco, provided his employees — at every level of the company, including the stores — compensation and benefits that are much higher than retail industry norms. For example, over 90% of Costco employees qualify for employer-sponsored health insurance; the US retail industry average is just under 60%. As a result, Costco has one of the lowest employee turnover rates in retail. In 2006, Costco's turnover rate was 17% overall and 6% after one year of employment. [ 7 ] In 1993, when growing competition threatened both Price Club and Costco Wholesale, Sinegal was invited to a partial merger. The two companies entered into a partial merger just after Price's earnings dropped by 40%. The new company, named PriceCostco, Inc., focused heavily on international expansion, opening stores in Mexico, South Korea and England. Despite best efforts to recover losses, sales continued to drop. Robert Price and James Sinegal had different opinions regarding company direction and recovery policies. A breakup between the companies was formally announced in 1994. Price's breakaway company was named as Price Enterprises. Sinegal still continued to manage PriceCostco, Inc. In 1997, the name of Sinegal's company was changed to Costco Wholesale. In an interview published in the Houston Chronicle on July 17, 2005, he told Steven Greenhouse that he did not care about Wall Street analysts who had criticized him for putting good treatment of employees and customers ahead of pleasing shareholders. Investors might want higher earnings, but Sinegal stated, \"We want to build a company that will still be here 50 and 60 years from now.\" A favorite quote attributed to Sinegal, in part about his philosophy on dealing with success, is \"You have to take the shit with the sugar\". Investors who bought $10,000 of Costco stock in 1992 found it worth $43,564 just 10 years later — a return of 354% (15.855%, annually). From 1985, when Costco went public, to 2020, the company's stock value increased 19,000%. [ 8 ] In 2009, Sinegal was named a TopGun CEO by Brendan Wood International, an advisory agency. [ 9 ] [ 10 ] Retirement [ edit ] On January 1, 2012, Sinegal retired as CEO of Costco Wholesale, continued to serve as Company Advisor and Director, and was succeeded by his long-term Costco colleague W. Craig Jelinek in 2012. [ 11 ] Sinegal retired from the Board of Directors in January 2018. [ 12 ] Personal life [ edit ] In 2008, Sinegal was part of an eleventh-hour local ownership group that committed to invest $450 million ($150 million from each of the three co-owners) for the renovation of Seattle's KeyArena , and to purchase the NBA 's Seattle SuperSonics franchise. [ 13 ] The bid failed, however, as NBA commissioner David Stern had already made a private deal with an Oklahoma-based ownership group to move the team to Oklahoma City (where it was renamed the Oklahoma City Thunder ). Sinegal and his wife, Janet, have three children. [ 14 ] Sinegal's son David owns and operates the Sinegal Estate Winery in St. Helena, California . [ 15 ] Sinegal is a staunch Democrat [ 16 ] and spoke at the 2012 Democratic National Convention . [ 17 ] [ 18 ] Sinegal has hosted President Barack Obama at his home on two occasions. [ 19 ] [ 20 ] Sinegal received an honorary doctorate from Dartmouth College alongside Jake Tapper and others in June 2017. [ 21 ] References [ edit ] ^ a b Allison, Melissa (September 1, 2011). \"Costco's colourful CEO, co-founder Jim Sinegal to retire\" . The Seattle Times . Retrieved October 13, 2024 . ^ a b \"Jim Sinegal\" . San Diego Community College District . Archived from the original on June 15, 2023 . Retrieved June 15, 2023 . ^ a b \"SDSU Alumni Companies\" . San Diego State University. Archived from the original on September 25, 2015 . Retrieved September 23, 2015 . ^ Forbes: CEOs: James D. Sinegal. ^ Eisner, Peter (December 14, 2009). \"Sol Price, philanthropist and entrepreneur, dies at 93\" . San Diego Jewish World . Retrieved June 6, 2023 . ^ Sinegal, Jim. \"Business is about more than making money\" . Directors & Boards . Retrieved May 26, 2023 . ^ Cascio, Wayne (December 2006). \"The High Cost of Low Wages\" . Harvard Business Review . Retrieved May 26, 2023 . ^ \"How Costco Became A Massive \"Members Only\" Retailer\" . YouTube . CNBC. September 12, 2020 . Retrieved May 26, 2023 . ^ The Market's Best Managers – Forbes.com , Forbes.com ^ Brendan Wood International Announces 24 TopGun CEOs in the US Archived January 18, 2016, at the Wayback Machine , Reuters.com ^ Allison, Melissa (September 1, 2011). \"Costco's colorful CEO, co-founder Jim Sinegal to retire\" . The Seattle Times . Retrieved February 19, 2019 . ^ \"Costco Wholesale Corporation – Investor Relations – Board of Directors\" . phx.corporate-ir.net . Retrieved January 21, 2018 . ^ \"Mayor Nickels announces local effort to buy Sonics, renovate KeyArena\" . www.seattle.gov . Archived from the original on November 18, 2021 . Retrieved February 19, 2019 . ^ Schmit, Julie (September 23, 2004) Costco wins loyalty with bulky bargains USA Today , accessed March 1, 2012 ^ Jackson, Candace (March 5, 2015) [1] The Wall Street Journal , accessed May 18, 2015 ^ Political donations Archived September 22, 2012, at the Wayback Machine Political donations ^ \"Costco's Sinegal in spotlight at Democratic convention tonight\" . The Seattle Times . September 5, 2012. Archived from the original on March 27, 2019. ^ Electad (September 6, 2012), Jim Sinegal Addresses The DNC, Charlotte, North Carolina – September 5 2012 , archived from the original on December 21, 2021 , retrieved February 19, 2019 ^ Brunner, Jim (July 21, 2014) [2] The Seattle Times , accessed May 20, 2015 ^ King 5 Staff (July 24, 2012) [3] Archived January 12, 2016, at the Wayback Machine King 5 News (NBC) , accessed May 20, 2015 ^ \"James Sinegal (Doctor of Humane Letters)\" . Dartmouth College . June 11, 2017 . Retrieved October 13, 2024 . Retrieved from \" https://en.wikipedia.org/w/index.php?title=James_Sinegal&oldid=1318677792 \" Categories : American Catholics Washington (state) Democrats American chief executives in retailing 1936 births Living people Costco people Businesspeople from Pittsburgh San Diego State University alumni 20th-century American businesspeople 21st-century American businesspeople People from Hunts Point, Washington Central Catholic High School (Pittsburgh) alumni Hidden categories: Webarchive template wayback links Articles with short description Short description matches Wikidata Use mdy dates from June 2022 Articles with hCards Search Search James Sinegal 5 languages Add topic",
    "Costco co-founder still goes into the office weekly at age 89 Skip Navigation Related Stories Power Players Jeff Bezos: One strategy 'increases your odds' of starting a successful business Leadership Harvard expert shares his 1 tip for living a happier, more successful life Work Walmart exec 'never believed' in 'work-life balance'—the mantra she uses instead Raising Successful Kids Child psychologist: People-pleasing kids can become unhappy adults—how to fix it Leadership The No. 1 trait this CEO looks for in a candidate—it 'always' outranks technical skills Costco Wholesale co-founder and retired CEO James Sinegal, second from right, speaks to MIT Sloan School of Management students. Boston Globe | Boston Globe | Getty Images Costco co-founder Jim Sinegal is retired … for the most part. The 89-year-old former CEO of the beloved warehouse chain stepped down from his role in 2012. But Sinegal still goes to the office some Tuesdays, a nod to the work ethic and commitment he learned from his mentor, the late retail businessman and philanthropist Sol Price. \"I think to be successful, you've got to be pretty focused,\" Sinegal said in an interview with The Wall Street Journal published on April 16. He added that, \"if you can find a mentor like I did, like Sol Price, it can make a significant difference in your life.\" For Sinegal, staying involved in his company is a no brainer. He dedicated a huge chunk of his life to retail, getting his start as a bagger at Price's FedMart at age 18 . Sinegal worked his way up to the C-suite before launching Costco alongside businessman and investor Jeff Brotman. There, he served as president and CEO for almost 30 years. Sinegal \"always loved\" working in the grocery industry and viewed his job as more of a hobby, he told The Wall Street Journal. As for work-life balance, staying busy in a role he loves, even after retirement, is the icing on the cake. \"I think there are three things that you have to worry about,\" he said. \"Worry about your livelihood, you gotta worry about your health and you gotta worry about your family. Anything else you do is a bonus, if you're able to sneak it in there.\" If you can find a mentor like I did ... it can make a significant difference in your life. James Sinegal Co-founder and former CEO of Costco Sinegal has offered similar advice to students and young entrepreneurs over the years. If you \"find something you are really passionate about and you won't have to work a day in your life,\" he noted in a 2016 speech to Loyola Marymount University students. In addition to going into the office, Sinegal says he still tries to visit Costco stores regularly — not out of any feeling of obligation, but because he's passionate about the company. \"Nobody is holding a gun to my head,\" he said in 2016. \"I do it because I love it, [and] if you can find something you love, it will be a great gift for you.\" 'Identity issues can loom large' in retirement Twenty-eight percent of retirees experience depression, which is higher than that of the overall older adult population, according to a 2020 study . That's one of the reasons why it's so important that workers be honest with themselves when considering what their last decades should look like, Harvard business administration professor and author Teresa M. Amabile wrote for CNBC Make It in November 2024. \"My research team at Harvard Business School and I spent a decade interviewing people to uncover the psychological, relational and life restructuring challenges of retiring — and how best to navigate them,\" Amabile wrote. \"We discovered that identity issues can loom large for people.\" Amabile recommends that younger employees ask themselves, \"Would I be more likely to say that my work is what I do or my work is who I am?\" If you realize your work is who you are, \"that insight could help you consider to what extent your strong work identity holds you back from starting a possibly wonderful retirement life,\" she wrote. Afterward, write down the values and characteristics you have that you deem important. If you write down something like \"hard worker,\" for example, you can \"bridge that identity gap\" by finding another way to practice dedication, like gardening, going to the gym or becoming more active in your community. \"Consider who you are in your career life, which pieces of your working self you'll be able to take with you, and which ones you want to leave behind,\" wrote Amabile. \"If you can do that honestly, you're more likely to find a satisfying retirement on the other side.\" Want a new career that's higher-paying, more flexible or fulfilling? Take CNBC's new online course How to Change Careers and Be Happier at Work . Expert instructors will teach you strategies to network successfully, revamp your resume and confidently transition into your dream career. Start today and use coupon code EARLYBIRD for an introductory discount of 30% off $67 (+taxes and fees) through May 13, 2025. Plus, sign up for CNBC Make It's newsletter to get tips and tricks for success at work, with money and in life. VIDEO 7:50 07:50 I left the U.S. for India and built a $23M burrito business Make It",
    "Meet Costco Cofounder Jim Sinegal: Life, Career, Family - Business Insider Lifestyle Meet Costco's multimillionaire cofounder Jim Sinegal, a Democrat megadonor who was only paid a third of the average CEO's salary during his time leading the wholesale retailer By Taylor Nicole Rogers Follow Taylor Nicole Rogers Every time Taylor Nicole Rogers publishes a story, you’ll get an alert straight to your inbox! Enter your email Sign up By clicking “Sign up”, you agree to receive emails from Business Insider. In addition, you accept Insider’s Terms of Service and Privacy Policy . Costco cofounder Jim Sinegal walks through a Costco store in 2012. SAUL LOEB/AFP via Getty Images 2020-09-16T18:39:00Z Share Facebook Email X LinkedIn Reddit Bluesky WhatsApp Copy link lighning bolt icon An icon in the shape of a lightning bolt. Impact Link Save Saved Read in app Add us on This story is available exclusively to Business Insider\n                subscribers. Become an Insider and start reading now. Have an account? Log in . Jim Sinegal cofounded Costco alongside Seattle attorney Jeff Brotman in 1983. Despite building one of the largest retail chains in America, Sinegal consistently earned less than other CEOs throughout his career at Costco and believes it's \"wrong\" for companies to have huge wage gaps between executives and other employees. Sinegal is a staunch Democrat, speaking on President Barack Obama's behalf at the 2012 Democratic National Convention, endorsing Hillary Clinton's 2016 presidential bid, and co-hosting a high-dollar fundraiser for Joe Biden. Sinegal owns a waterfront mansion outside Seattle and a vineyard in Napa Valley. Sinegal retired in 2018 but remains one of Costco's largest shareholders. His stake alone was worth $263.2 million in 2018. Visit Business Insider's homepage for more stories . After discovering a passion for retail in college, Jim Sinegal cofounded Costco and built it into one of the largest retailers on the globe, while largely staying out of the limelight himself. Before he retired from Costco's top post in 2012, Sinegal defined nearly every aspect that makes the beloved warehouse retailer what it is today, from its low prices to its barebones decor. During his time at the company, he took a relatively low salary for an executive of his influence. A representative for Sinegal at Costco did not immediately respond to Business Insider's request for comment on the former CEO's tenure at the company, net worth, political activities, or philanthropy. Keep reading to learn more about Costco cofounder Jim Sinegal. James Sinegal, 84, first entered the grocery business while still in college. Costco cofounder and former CEO Jim Sinegal. Joe Raedle/Getty Images Sinegal was born into a working class family in Pittsburgh. His father was a coal miner and a steelworker, The New York Times reported. When Sinegal was 18, he took on what he thought would be a one-day job unloading mattresses at Fed-Mart, one of America's first warehouse retailers, according to The Times . Sinegal went on to earn a bachelor's degree from San Diego State University in 1959 , while still working at Fed-Mart as a bagger. He eventually rose to become the company's executive vice president for merchandising, before leaving Fed-Mart alongside its founder Sol Price (who was ousted after selling the company to a German retailer) to launch another warehouse store called Price Club in 1976 that only sold memberships to small businesses, per The Times . According to Costco's website, Sinegal served as Price Club's executive vice-president of merchandising, distribution, and marketing and \"was instrumental in fine-tuning the merchandise and marketing strategies.\" Sinegal opened the first Costco warehouse location in Seattle in 1983. The first Costco. Courtesy of Costco Wholesale Costco's other cofounder, Jeff Brotman, was an attorney by trade but was inspired to enter the wholesale retail space after seeing a similar store during a trip to France, Business Insider previously reported. Despite not knowing one another, Brotman cold-called Sinegal and proposed that they go into business together. Sinegal was 46 years old at the time, per San Diego State University . According to Sinegal , the \"crowds weren't overwhelming\" when Costco first opened, but \"business built up\" gradually. Within a year, the company opened secondary locations in other parts of Washington state. Costco merged with rival Price Club in 1993 to form the chain we know today, Business Insider previously reported. During his 35-year career at Costco, Sinegal was known for being frugal and going out of his way to help his employees. Costco cofounder and former CEO Jim Sinegal speaks in 2005. REUTERS/Robert Sorbo Washington Post's Jena McGregor wrote ahead of Sinegal's retirement in 2011 that it was \"hard to imagine anyone with less pretense, more discipline or more integrity leading a major corporation today.\" An often retold story about Sinegal depicts the former CEO discovering that Costco paid 88% of employee's health care expenses, just short of the 90% the company had previously committed to. Sinegal not only reimbursed employees for the extra 2%, but added stock directly into their 401ks so it wouldn't be taxed, according to The Washington Post . \"This is not altruistic,\" Sinegal told The New York Times in 2005 about Costco's wages and benefits plans, which the paper called generous. \"This is good business.\" Sinegal also pioneered several of Costco's signature methods of keeping costs low, including its no-frills retail spaces, limited inventory, and non-existent advertising, per The New York Times . Sinegal wasn't just passionate about saving the company money. He prevented Costco from marking up the prices of its inventory more than 14% or 15% over its cost to the store, even if shoppers were accustomed to paying more elsewhere, The New York Times reported. Despite Costco's immense success, Sinegal earned only a third of what his fellow CEOs did while leading the company. Costco CEO Jim Sinegal smiles at a reopening of a Costco store in Redwood City, California in October 2009. AP Photo/Paul Sakuma Sinegal took a $350,000 salary during his tenure at Costco — far below the industry standard $1 million for Fortune 100 CEOs at the time, according to The Washington Post . In 2010, Sinegal earned a total of $3.5 million once his stock options were factored in, per The Post . The median Fortune 100 CEO brought home $9.3 million, however. Even with a smaller than average compensation package, Sinegal \"no doubt has become wealthy through Costco,\" The Post reported. Sinegal had a net worth of more than $120 million in 2005 largely due to his stake in the warehouse retailer, according to The New York Times . By 2018, that stake was worth $263.2 million, The Seattle Times reported. \"I've been very well rewarded,\" Sinegal told The Times about his salary. \"I just think that if you're going to try to run an organization that's very cost-conscious, then you can't have those disparities. Having an individual who is making 100 or 200 or 300 times more than the average person working on the floor is wrong.\" Sinegal also wears clothes from Costco's Kirkland brand and is \"obsessed\" with Kirkland products, he told students during a speech at San Diego State University in 2019. Costco's office space itself also reflected Sinegal's modesty. The Post described the CEO's office as a \"tiny alcove without a door; the furnishings are literally as fancy as folding chairs,\" and said that Sinegal even answered his own phone instead of employing a secretary to do it. Sinegal retired in 2018. Costco cofounder and former CEO Jim Sinegal addresses the Democratic National Convention in 2012. AP Photo/J. Scott Applewhite Sinegal stepped down as Costco's chief executive on New Year's Day in 2012, according to The Washington Post . However, he did stay on as an advisor and member of Costco's board of directors until 2018. Current Costco CEO Craig Jelinek succeeded Sinegal, Business Insider previously reported. Jelinek had worked with Sinegal since the cofounder's FedMart days and joined Costco just months after the first location opened. For the most part, Jelinek has upheld Sinegal's leadership strategy, prioritizing employees and keeping costs low for customers. \"We just stayed to our principles — it's what we do, take care of customers and employees and the people who are selling us merchandise,\" Jelinek told The Seattle Times . Sinegal did seemingly splurge on his living space, however — he lives in a ritzy lake-front community outside Seattle. Lake Washington pictured during a protest in April 2020. Sinegal's property not pictured. David Ryder/Getty Images Sinegal lives in a waterfront mansion in Hunts Point on Lake Washington, according to Realtor.com . Sinegal's neighbors include former Microsoft CEO Steve Ballmer, who owns $9.8 million and $12 million homes nearby, and department store heir and former Seattle Seahawks owner John Nordstrom, per Realtor.com . Sinegal lives with his wife Janet, a philanthropist. The couple met as students at San Diego State University and have three adult children. Sinegal also co-owns a vineyard in Napa Valley with his son David, he told The Seattle Times in 2018. The Sinegals hosted two fundraisers for former President Obama's reelection campaign at their \"sprawling\" Lake Washington estate in 2012, where guests paid as much as $35,800 to meet with Obama, The Seattle Times reported. Sinegal is an outspoken Democrat. Former Vice President Joe Biden poses with his Costco card and Jim Sinegal (right) at a Costco store in Washington, DC, in 2012. SAUL LOEB/AFP via Getty Images Sinegal made a speech in support of President Obama at the 2012 Democratic National Convention. \"Some of my friends in corporate America say that they need a government that gets off the backs of businesses, and that's why they're supporting the opposition with donations of hundreds of millions of dollars,\" Sinegal said , \"but I think they've got it all wrong. Business needs a president who has covered the backs of businesses, a president who understands what the private sector needs to succeed, a president who takes the long view and makes the tough decisions. And that's why I'm here tonight supporting President Obama.\" Sinegal's involvement in Obama's reelection effort didn't end there. The Costco cofounder wrote an email blast for the Obama campaign and donated $200,000 to groups supporting the former president, per The Washington Post . Outside of the campaign, The Post described Costco's relationship with the White House as a \"romance.\" Obama frequently mentioned shopping at Costco, and called Sinegal \"a great friend of mine and somebody who I greatly admire\" during a 2014 visit to a Costco store, per The Post . In 2016, Sinegal endorsed former Secretary of State Hillary Clinton for president, signing a letter alongside other business leaders including Google cofounder Eric Schmidt, designer Rebecca Minkoff, BET founder Robert Johnson, LinkedIn founder Reid Hoffman, and Netflix CEO Reed Hastings, Business Insider previously reported. In June 2019, Sinegal co-hosted a fundraiser for former Vice President Joe Biden's presidential campaign in Medina, Washington, alongside Microsoft executives and Seattle's former deputy mayor, The Seattle Times reported. He also donates a lot of money to higher education. The San Diego State University Aztec logo in Viejas Arena in February 2020. Kent Horner/Getty Images The Sinegals operate their own family foundation, which issues five full tuition scholarships to students at Heritage University annually. The couple has also made numerous gifts to fund scholarships at their alma mater, San Diego State University. Sinegal was one of several Washington-based entrepreneurs to contribute to the University of Washington's coronavirus testing research amid the pandemic, per The Seattle Times . Although the exact size of Sinegal's gift was not disclosed, he was listed among the \"major donors\" who gave between $200,000 and $2 million. The project's full donor list reads like a who's-who of the Seattle chapter of the three comma club — former Microsoft CEO Steve Ballmer, Amazon CEO Jeff Bezos, Schmidt, and Microsoft CEO Satya Nadella all chipped in, according to The Seattle Times . \"There are a lot of smart, hardworking people out there, and not all of them make it,\" he told students during a speech at San Diego State University in 2019. \"You earn a reputation for ethical practice by being consistent and avoiding arrogance. It's easy to get corrupted if you're not paying attention on a daily basis.\" Arts & Culture Costco Retail More Billionaires Billionaire Read next Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know HOME Subscribe This story is available exclusively to Business Insider\n      subscribers. Become an Insider and start reading now. Have an account? Log in . Jump to Main content Search Account",
    "Reddit - The heart of the internet Skip to main content Go to todayilearned r/todayilearned r/todayilearned You learn something new every day; what did you learn today?\nSubmit interesting and specific facts about something that you just found out here. Members • Cheeky_Guy Português (Brasil) Français Suomi 한국어 Bahasa Melayu Filipino Türkçe Magyar Italiano TIL that James Sinegal, former CEO of Costco, said he did not care about Wall Street analysts who had criticized him for putting good treatment of employees and customers ahead of pleasing shareholders. A favorite quote attributed to Sinegal is “you have to take the shit with the sugar” en.wikipedia.org Open Share Top Posts Reddit reReddit: Top posts of June 29, 2014 Reddit reReddit: Top posts of June 2014 Reddit reReddit: Top posts of 2014 Reddit Rules Privacy Policy User Agreement Accessibility Reddit, Inc. © 2025. All rights reserved. Expand Navigation Collapse Navigation",
    "Obituary | Joseph James Sinegal, Jr. of Beaumont, Texas | Calvary Mortuary Calvary Mortuary | View Obituaries Joseph James Sinegal, Jr. November 6, 1958 - April 9, 2022 Obituary Joseph James Sinegal, 63, of Beaumont, Texas, moved on from this Earthly Life to his Heavenly Life on Saturday, April 9, 2022. With sadness in our hearts, we find solace in knowing that he is in a better place. A Memorial Service will be held on Saturday, April 16, 2022, at 10:00 A.M. at Calvary Mortuary Chapel under the direction of Calvary Mortuary Staff. Joseph’s love and memories will remain in the hearts of his daughter, Dominique Sinegal; father, Joseph James Sinegal, Sr.; brother, Darrell Sinegal (Sherhonda); one grandchild; and a host of other relatives, and friends. Masks Required To send a flower arrangement in memory of Joseph James Sinegal, Jr. , please click here to visit our sympathy store . Services Memorial Service Saturday, April 16, 2022 10:00 AM Calvary Mortuary TFSC License #762 Beaumont, Texas 77701 Directions Email Details Guestbook « ‹ › » Sign the Guestbook Name Email Message 500 words remaining Please keep my message private More Less Guestbook Options Image Light A Candle Candle 1 Candle 2 Candle 3 Candle 4 Required Confirmation: Submit Guestbook entry Send Flowers Express your condolences with flowers sent to Joseph's family Order Online Or, Order By Phone 888-297-2053 Code: 69348 Plant Trees In Remembrance Honor a loved one by planting trees in their memory. Learn More Guestbook Share your thoughts and memories of Joseph View & Sign Sympathy Card Share your thoughts and memories with family and friends of Joseph Send to Family",
    "A Great Team: Jeff and Jim | UW Medicine A Great Team James D. Sinegal co-founded Costco Wholesale Corporation with Jeffrey H. Brotman — a UW Medicine advocate and Laureate — 35 years ago. Mr. Sinegal remembers Mr. Brotman, who died on Aug. 1, 2017. Right after someone dies, it’s hard to remember that they’re gone. The other day, I drove to work and my first thought was: where’s Jeff’s car? Later, I was at a budget meeting and wondered: why isn’t Jeff in his usual seat? It catches me off guard every time. And I’m glad it does, because I don’t want to lose the immediacy of my grief. We were more than colleagues; he was one of my dearest, most trusted friends. When you’re looking for a business partner — which is what Jeff and I were doing 30-some years ago — you’re looking for intelligence, vision and persistence. Really liking and enjoying that business partner is a gift. I remember hitting it off with Jeff immediately; he was a charming guy. And a good thing, too, because we spent a lot of time together. The other day, I was calculating how many miles we logged on business flights over the last 35 years, and it totaled around 6 million. About 20 years ago, we were on one of those flights, and when the plane landed, we were chagrined to find that we had the wrong paperwork. We needed Chinese visas, but what we had were visas from the Republic of China (Taiwan). The military guard rolled his eyes at our idiocy. Although we eventually got the right visas, our adventures weren’t over. A few days later, as we were leaving China, airport authorities intercepted us, locked us into a tiny white room, and left us to cool our heels. About 90 minutes into our wait, Jeff looked me in the eye. “This is another fine mess you’ve gotten me into,” he said. I like to think that Jeff and I were a much more efficient, productive team than Laurel and Hardy, at least where Costco was concerned. We made all our major decisions together, whether it was about a merchandising opportunity, a new site or a new partner. This is not to say that we didn’t argue. Of course we did. We had some doozies over the years, but here’s the thing: they didn’t last more than a day. Jeff never harbored animosity towards anyone. We’d see each other and exchange a hug — it’s very difficult to be angry with someone when you’ve just given them a hug — and we’d work past our difficulties. I imagine Jeff taught other people the same kinds of lessons he taught me: laugh a little at your problems. Don’t hold on to anger. And, of course, be bold. In later years, when reporters asked us if we were surprised by Costco’s success, I always gave the literal answer: yes. Because our original business plan had us developing, at max, 12 stores. Jeff gave the better answer, the one that delivered the joke. “Well, I always knew it was going to be that big,” he said with a twinkle. “Jim just lacks my vision.” We were a great team. Together, we lived through many scary moments as we built our business, but many more happy times as we celebrated every success over the past 35 years. All of those memories are indelibly fixed in my mind. I’m going to miss him very much. Photos courtesy of James Sinegal. Jim Sinegal (l) and Jeff Brotman (r) at the grand opening of a Costco warehouse in Anchorage, Alaska, in October 1984. Change cookie settings Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies 3rd Party Cookies Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookies should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled 3rd Party Cookies This website uses Google Analytics, Google Tag Manager, Meta, LinkedIn and Google Ads to collect anonymous information to analyze site usage and assist in marketing efforts. Keeping these cookies enabled helps us to improve our website and customize your website experience. Enable or Disable Cookies Enabled Disabled Enable All Reject All Save Changes Powered by GDPR Cookie Compliance",
    "A Dozen Things I’ve Learned from James Sinegal – 25iq 25iq My views on the market, tech, and everything else A Dozen Things I’ve Learned from James Sinegal May 24, 2014 ∞ In the past few blog posts I have explained what creates a “moat” (i.e., a sustainable barrier to entry against competitors). Costco is an interesting case in that instead of a dominant reason for the moat’s existence (for example, self-reinforcing demand side economies of scale/network effects in the case of Google) there are lot of little things which create the Costco moat. As is the case with Starbucks, the moat is made up of a lollapalooza of factors like brand, company culture, systems and supply-side economies of scale.  In 2001, the year the Internet bubble popped, Jim Sinegal met Jeff Bezos in a Starbucks in Bellevue, Washington and told the Amazon CEO about the Costco business model.  In the book “ The Everything Store ” the author writes about that meeting: “Sinegal explained the Costco model to Bezos: it was all about customer loyalty. There are some four thousand products in the average Costco warehouse, including limited-quantity seasonal or trendy products called treasure-hunt items that are spread out around the building. Though the selection of products in individual categories is limited, there are copious quantities of everything there—and it is all dirt cheap. Costco buys in bulk and marks up everything at a standard, across-the-board 14 percent, even when it could charge more. It doesn’t advertise at all, and earns most of its gross profit from the annual membership fees. ‘The membership fee is a onetime pain, but it’s reinforced every time customers walk in and see forty-seven-inch televisions that are two hundred dollars less than anyplace else,’ Sinegal said. ‘It reinforces the value of the concept. Customers know they will find really cheap stuff at Costco.’” As I said in my post about Jeff Bezos , the existence of “pricing power” and attractive returns on invested capital are the right test of whether a moat exists. Morningstar writes: “Because much of Costco’s membership revenue is booked in advance, cash flow volatility is below average. Membership renewal rates stand at about 90% in the U.S. and Canada, and they did not materially differ from this level during the Great Recession. On a global basis, renewal rates stand at about 86%…  With an average of 3,800 active stock-keeping units per club versus more than 60,000 at most mass-merchant superstores, Costco wields almost as much bargaining power as Wal-Mart and Kroger. The firm reduces handling costs by purchasing merchandise directly from manufacturers and storing merchandise on sales floors rather than in central warehouses. Self-service store formats and modest marketing requirements help to minimize operating costs, allowing Costco to deploy much of its assortment as a loss leader. …Costco derives roughly 75% of its operating profits from membership fees. Member renewal and retention rates have not suffered much after membership fee increases, suggesting that Costco also wields meaningful pricing power over its customers. However, Costco offsets thin margins with massive sales volume and rapid inventory turnover, leading to exceptional unit productivity levels. In fiscal 2013, Costco generated about $162 million per club, compared with $80 million per unit at Sam’s Club in its most recent fiscal year. On a square footage basis, this translates into more than $1,100 net sales per square foot, a range normally reserved for high-end jewelers and fashion apparel retailers. Exceptional productivity also leads to strong returns on invested capital, which have consistently been in the low to mid-teens over the past five years, comfortably ahead of our 8.6% cost of capital assumption.” – Costco’s Bulking Up Its Moat 2. “Anybody can sell merchandise for low prices. The trick is to be able to do it well and to make money while you’re doing it.” As Charlie Munger said at the 2014 Berkshire meeting: “Costco is unbelievable.  It is against the human nature of many entrepreneurial people to get price down and service up…” As I also noted in my post on Jeff Bezos, if you lower prices, sales volume goes up and that drives absolute dollar free cash flow and the interest free loan from suppliers – known as float. That higher sales volume gives Costco huge leverage with the one vendor that it decides to carry (Safeway negotiates with many suppliers of peanut butter while Costco has one). Costco also focuses on a specific set of customers, argues Megan McCardle: “Costco really is a store where affluent, high-socioeconomic status households occasionally buy huge quantities of goods on the cheap: That’s Costco’s business strategy (which is why its stores are pretty much found in affluent near-in suburbs).” – Bloomberg 3. “We’re not kamikaze pilots. We want to do things in a sensible fashion. If we can speed up our growth, without outdistancing our management team, and provide a quality product, then we will do so.” The easiest and best way to be smart is to not be stupid. That Charlie Munger is on the Costco board of directors of a company which takes pride in being sensible should not be a surprise. Costco opens new stores at a reasonable pace each year. Lots of the expansion is outside the US.  Not getting too far out in front of your skis on store openings is wise. For this reason, Costco opens 25-30 new warehouses each year. 4. “Paying good wages is not in opposition to good productivity.” “You’ll get good people” If you have stores with fewer SKUs and products that sit on pallets they came in, productivity goes up. Someone is paying for all those people who haunt the grocery store aisles stocking goods and straightening boxes and that gets reflected in grocery store prices. Megan McArdle writes : “Costco has a tiny number of SKUs in a huge store — and consequently, has half as many employees per square foot of store. Their model is less labor intensive, which is to say, it has higher labor productivity.” CBS News reported this week that according to data complied by Glassdoor: “ Costco  ranks as the second-best company for pay and benefits , trailing slightly behind Google.  The average annual salary for a Google product manager is $146,215, according to Glassdoor data. The average hourly pay for a front-end cashier at Costco, by comparison, is $16.07 an hour. ” 5. “If you’re a big-picture guy, you’re not in the picture. Retail is detail.” A number of very prominent hedge fund investors have been brutally punished by venturing into retail, via companies like JC Penney and Sears. Retail is hard. At the 2014 Berkshire meeting , “Buffett noted that most of his investment misses — at least those related to straying outside his circle of competence — have been in retail. Without explicitly saying, he more or less chalked this up to not knowing the businesses.” 6. “This is almost like show business. I mean, every day you’re opening up and it is show time.” The “treasure hunt” aspect of shopping at Costco is intentional.  Some people get a dopamine rush when they find the unexpected treasure as the wander the aisles at Costco.  The feeling of walking out of Costco having spent more than you imagined going into the warehouse is common. Charlie Munger puts it this way: “If you get hooked on going to Costco with your family, you’ll go for the rest of your life.” 7. “I think the biggest single thing that causes difficulty in the business world is the short-term view. We become obsessed with it. But it forces bad decisions.” “One of the follies of American business is that we are all so tied into these quarterly results and having to perform that it’s damaged a lot of businesses.” “You have to worry about where the business is headed long-term .” My post on Jeff Bezos explains how this creates competitive advantage over other companies who only think about the short term, and drive the business based on short term changes in ratios. 8. “Wall Street is in the business of making money between now and next Tuesday. We’re in the business of building an organization, an institution that we hope will be here 50 years from now.” “Driving stock up from one day to the next is not what we are about. We are about building a good company and performing for the long term. I know everyone says that, that sounds trite when I repeat it that way, but that is and has always been our attitude about our business. If we do the right things, the stock price will take care of itself, and our shareholders will be rewarded.” It’s that simple. 9. “You haven’t got enough space in your paper to print all the errors we’ve made. But what we like to say is that we’re not going to make that same mistake five times .” Try to make new mistakes, but recognize that making mistakes is a part of finding success.  It is wise to fail regularly at new things, trying to learn “ via negativa ”, but fail quickly when you do fail. “Jeff Brotman, Costco’s co-founder and chairman, says Bezos “doesn’t have to make a profit or break even on” services like Amazon Prime and AmazonFresh. “He’s building great loyalty with that, as we have with our executive membership,” which costs $110 a year and entitles members to additional benefits. Like other Costco executives, Brotman was skeptical that home grocery delivery could be profitable, but he notes that Amazon doesn’t really have to make it work perfectly in the short term: ‘He can spend a billion dollars experimenting and putting televisions on a truck and delivering them the same day with apples and oranges. That’s a research and development experiment that competitors and normal online businesses can’t do.’” – Businessweek 10.  “We want to turn our inventory faster than our people .” Employee turnover is costly. New employees need to be trained and mistakes can be made in hiring. The only complaint I have heard from a Costco employee is that you advance at Costco one retirement at a time. Charlie Munger has a different view and calls Costco: “a total meritocracy.” 11. “We would rather have our employees running our business.” As is the case at Nordstrom, Costco employees start at the bottom and for that reason understand the business from the ground up. Letting ‘the employee who sweeps the floor, select the broom’ means jobs get done better and employees both feel better about themselves and are happier. As I wrote in my post on Howard Schultz , Starbucks similarly thinks store managers making decisions about that store is wise. In his book “The Outsiders” William Thorndike writes: “There is a fundamental humility to decentralization, an admission that headquarters does not have all the answers and that much of the real value is created by local managers in the field.” 12. “Competition makes us better. Some of our best stores have a Sam’s Club next door.” Sam’s is a competitor, but Amazon is a bigger threat . Jim Sinegal perhaps regrets that he taught Jeff Bezos so much about Costco’s business model, but great CEOs are often natural teachers. And that’s a good thing. Finally, Morgan Housel writes : “Asked about his favorite company outside of Berkshire, Munger literally interrupted the questioner and answered, “That’s easy. It’s Costco. “It’s one of the most admirable capitalistic institutions in the world. And its CEO, Jim Sinegal, is one of the most admirable retailers to ever live on this planet,” he gushed. “I just can’t say enough about my admiration for Costco. More of you should look at Costco. In fact, every time Donald Trump says something and you get discouraged, you should think about Costco.” He wasn’t done. “It has a frantic desire to serve customers a little better every year. When other companies find ways to save money, they turn it into profit. Sinegal passes it on to customers. It’s almost a religious duty. He’s sacrificing short-term profits for long-term success.” This wasn’t the first time Munger let his admiration run wild. Last year he said, “Generally speaking, I believe Costco does more for civilization than the Rockefeller Foundation.” Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like this: Like Loading... A Dozen Things I’ve Learned About Marketing, Distribution and Sales A Dozen Things I’ve Learned about Great CEOs from “The Outsiders” (Written by William Thorndike) Categories: Uncategorized %d",
    "James Sinegal (Doctor of Humane Letters) | Dartmouth Skip to main content Search search More news Articles James Sinegal (Doctor of Humane Letters) Image Image James Sinegal is awarded an honorary degree during Dartmouth’s 2017 Commencement ceremonies. (Photo by Robert Gill) 6/11/2017 Body JAMES D. SINEGAL, as an accomplished entrepreneur, you have predicated your business success on a philosophy that always puts people first. Your passion for retail business was born while you were bagging groceries at FedMart in the mid-1950s. You worked your way up to executive vice president in charge of merchandising and operations, gaining extensive experience in sales and management. In 1983, you co-founded Costco and led the “warehouse store” concept to unprecedented growth. You pioneered the inclusion of fresh food, pharmacies, eye-care clinics, and gas stations into the “warehouse club” model. And your legendary love of a $1.50 hot dog has made it a signature favorite at Costcos nationwide. By visiting every Costco location each year, you never lost sight of the importance of frontline employees to the business’s long-term financial success. In putting faith in your employees, you instilled loyalty in them. You compensated them well for their work, encouraged them to take ownership and initiative, and afforded them opportunities for advancement, often promoting from within. As a result, you achieved the highest productivity and lowest employee turnover rates in retail, and built a culture focused on providing the best customer experience and the lowest available prices. This unconventional model not only delighted your customers, but generated outstanding returns for your shareholders, proving that it is, indeed, possible to do well by doing good. For your inspirational and innovative leadership style and your dedication to the idea that if you put people first, profits will follow, we are pleased to award you the honorary degree of Doctor of Humane Letters. Office of Communications Share this Facebook X Email Categories Events Tags Commencement Quoted Quote I tried to lead them through a moment of silence, which I think is really, really hard for people to sit in right now. And also kindness, and what kindness means, and actually feeling kindness. Byline Sandra Oh, actor and 2025 Commencement speaker | Attribution The Late Show With Stephen Colbert Date 7/22/2025 Videos Video Highlights From Commencement 6/18/2025 Description Dartmouth celebrates students’ accomplishments and the importance of “checking in.” Video Custom thumbnail",
    "Error fetching content: 403 Client Error: Forbidden for url: https://www.thomasnet.com/insights/6-business-strategy-management-lessons-from-costcos-james-sinegal/",
    "Costco Wholesale co-founder to discuss company’s evolution St. Mary's University 1 Camino Santa Maria San Antonio , TX 78228 +1-210-436-3011 https://www.stmarytx.edu William Joseph Chaminade Skip to main content January 30, 2020 James Sinegal will speak at the Forum on Entrepreneurship Breakfast Series James\nSinegal, co-founder and former CEO of Costco Wholesale, will be the Forum\non Entrepreneurship Breakfast Series keynote speaker Thursday, Feb. 13. The breakfast discussion, titled\n“Costco since 1983,” will be held at the Pearl Stable of the Historic Pearl\nBrewery. The Meadows Center for\nEntrepreneurial Studies at St. Mary’s University hosts the ongoing breakfast\nseries. Registration, networking and breakfast at the Pearl Stable begin at 7\na.m., followed by the program at 8 a.m. “We are privileged to host Jim\nSinegal as our distinguished speaker for the Forum on Entrepreneurship\nBreakfast Series. This is a rare opportunity for students, faculty and the\nbusiness community in San Antonio to hear from the leader of one of the most\niconic brands in the industry,” said Tanuja Singh, D.B.A., Dean of the Greehey\nSchool of Business. “Costco is considered the gold standard when it comes\nethical leadership and caring for its employees and its partners.” Sinegal began his career in retail\nbusiness in 1954. As an 18-year-old college student, he went to work for the\nlegendary retail icon Sol Price at the discount store FedMart in San Diego.\nSinegal remained working for Price for almost 30 years before striking out on\nhis own to start Costco with his business partner, Jeff Brotman. Costco today has revenues of more\nthan $149 billion and operates 783 warehouses in 44 states, Puerto Rico and 13\ncountries. The company employs more than 254,000 people worldwide and has\nearned a reputation as a fair and progressive employer. Sinegal retired from his executive\nposition with Costco in 2012 and remained on the board of directors until\nJanuary 2018. Sinegal serves as a trustee for\nFred Hutchinson Cancer Research Center. He was, until recently, a Senior\nExecutive-in-Residence at Seattle University’s ​Albers School of Business and\nEconomics and serves in a similar capacity at his alma mater, San Diego State\nUniversity. Sinegal also serves as an adviser at the Mendoza College of\nBusiness for the University of Notre Dame. “Having sold more than $30 million\nin home improvement products a year for many years through Costco stores, I saw\nfirsthand how Costco treated its vendors/suppliers differently than other big\nbox stores — they were a true partner in every way,” said Chris Edelen,\nChairman of the Forum on Entrepreneurship Breakfast Series and St. Mary’s\nExecutive in Residence. “Mr. Sinegal will share details on how he was able to\nbuild one of the largest retail companies in the world. This inside look will\nbe very valuable to both executives and students alike.” More about the Forum Breakfast series The Meadows\nCenter for Entrepreneurial Studies promotes and encourages entrepreneurial\nthought, business and activities locally, regionally and nationally. The\npurpose of the Forum on Entrepreneurship Breakfast Series is to offer the\nlarger San Antonio community and students of St. Mary’s University a forum to hear\nfrom some of the most talented individuals in industry and government. Funds\ngenerated from the series support student scholarships and encourage\nentrepreneurial activities in San Antonio and the region. The series’ 2019-2020 title sponsor\nis PwC. For information on sponsorship opportunities and purchasing tables and\nindividual tickets, please contact Pamela Luna at forumbreakfast@stmarytx.edu or\n210-436-3124. Read More Stories $1.2 million gift from Methodist Healthcare Ministries supports St. Mary’s Law clinics St. Mary’s Law study shows benefits of Catholic legal education J.D. alumnus embraces assisting physicians and military members Engineering and Softball alumna turned medical student credits St. Mary’s for graduate school preparation Back to top We use cookies to collect and analyze information on site performance and usage, and to enhance and customize content and targeted advertisements. Accept Cookies Reject Cookies Cookie Policy You can revoke your consent any time using the Cookie Notice button. Cookie Notice"
  ],
  "links": [
    "https://en.wikipedia.org/wiki/James_Sinegal",
    "https://www.cnbc.com/2025/05/03/costco-co-founder-still-goes-into-the-office-weekly-at-age-89.html",
    "https://www.businessinsider.com/meet-costco-cofounder-jim-sinegal-net-worth-house-philanthropy-2020-9",
    "https://www.reddit.com/r/todayilearned/comments/29fedo/til_that_james_sinegal_former_ceo_of_costco_said/",
    "https://www.calvarymortuarybeaumont.com/obituary/joseph-sinegal-jr",
    "https://give.uwmedicine.org/stories/a-great-team-jeff-and-jim/",
    "https://25iq.com/2014/05/24/a-dozen-things-ive-learned-from-james-sinegal/",
    "https://home.dartmouth.edu/news/2017/06/james-sinegal-doctor-humane-letters",
    "https://www.thomasnet.com/insights/6-business-strategy-management-lessons-from-costcos-james-sinegal/",
    "https://www.stmarytx.edu/2020/costco-forum-breakfast/"
  ]
}