{
  "query": "Joe Rogan",
  "rendered_query": "\"Joe Rogan\"",
  "total_results": 10,
  "texts": [
    "Joe rogan JRE The Joe Rogan Experience podcast is a long form conversation hosted by comedian Joe Rogan with friends and guests that have included comedians, actors, musicians, MMA fighters, authors, artists, and beyond. watch now About Photo by Troy Conrad Joe Rogan A standup comedian for over 30 years, Rogan’s seventh hour long comedy special Joe Rogan: Burn the Boats premiered live on Netflix on August 3, 2024 . Rogan’s previous comedy specials include Joe Rogan: Strange Times (2018) and Joe Rogan: Triggered (2016) for Netflix, Joe Rogan: Rocky Mountain High (2014) for Comedy Central, Joe Rogan: Live from the Tabernacle (2012) released via his website, Talking Monkeys in Space (2009) on CD & DVD, and Joe Rogan Live (2007) on DVD. Additionally, Rogan released the CDs Shiny Happy Jihad (2007) and I’m Gonna Be Dead Someday (2000). Rogan is host of The Joe Rogan Experience, consistently ranked one of the most popular podcasts and currently distributed by Spotify. The Joe Rogan Experience launched on December 24, 2009 helping to create the space of long form conversation video podcasting. With over 2000 episodes, an average of 2  - 3 hours in length each, the show has become a destination for open dialogue with a wide range of guests and perspectives including standup comedians, athletes, authors, artists, prolific thinkers, and scientists. Since 2002, Rogan has provided color commentary for the UFC (Ultimate Fighting Championship).  Rogan’s passion for MMA began with martial arts practice at the age of 13. Within two years, the Boston native earned a black belt and soon became the Massachusetts full contact Tae Kwon Do champion four consecutive years.  By the age of 19, Rogan won the US Open Tae Kwon Do Championship and as lightweight champion went on to beat both the middle and heavyweight title-holders to obtain the Grand Championship. Film credits include Here Comes The Boom (2012) and Zookeeper (2011) . Rogan  hosted Joe Rogan Questions Everything (2013) for the SyFy channel.  Rogan hosted the competition reality series Fear Factor on NBC in 2011/12 and previously for six seasons on the network from 2001-2006.  Prior to Fear Factor , Rogan played Joe Garrelli, the resident electrician on the hit NBC comedy series NewsRadio . Rogan regularly performs stand-up locally in Austin at his club Comedy Mothership as well as touring across the country and internationally.",
    "Joe Rogan (@joerogan) • Instagram photos and videos",
    "The Joe Rogan Experience | Podcast on Spotify The Joe Rogan Experience Joe Rogan Follow The official podcast of comedian Joe Rogan. 4.7 (932.1K) Comedy Culture Society All Episodes #2408 - Bret Weinstein Bret Weinstein, PhD, is an evolutionary biologist, author, and co-host of “The DarkHorse Podcast” with his wife, biologist Heather Heying. They are the co-authors of “A Hunter-Gatherer’s Guide to the 21st Century: Evolution and the Challenges of Modern Life.”www.bretweinstein.netwww.youtube.com/@DarkHorsePodwww.penguinrandomhouse.com/books/618153/a-hunter-gatherers-guide-to-the-21st-century-by-heather-heying-and-bret-weinstein/  Perplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.  Buy 1 Get 1 Free Trucker Hat with code ROGAN at https://happydad.com  Visit https://tractorsupply.com/hometownheroes Learn more about your ad choices. Visit podcastchoices.com/adchoices E Today 3 hr 8 min #2407 - Billy Bob Thornton Billy Bob Thornton is an Academy Award–winning actor, filmmaker, and musician. He currently stars as Tommy Norris in the Paramount+ series “Landman” and is the lead singer of The Boxmasters. Season two of “Landman” premieres on November 16. “Pepper Tree Hill,” the latest album from The Boxmasters, is available now.www.paramountplus.com/shows/landman/www.theboxmasters.com  Perplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.  Get a free welcome kit with your first subscription of AG1 at https://drinkag1.com/joerogan  Take 50% off a SimpliSafe system at https://simplisafe.com/ROGAN Learn more about your ad choices. Visit podcastchoices.com/adchoices E Friday 2 hr 58 min #2406 - Russell Crowe Russell Crowe is an Academy Award–winning actor, director, and vocalist of the band Indoor Garden Party. His latest film role is that of Nazi war criminal Hermann Göring in the historical drama “Nuremberg,” which premieres in theaters on November 7. https://www.sonyclassics.com/film/nuremberg/www.indoorgardenparty.com  Perplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.  Try ZipRecruiter FOR FREE at https://ziprecruiter.com/rogan  Get Gameday Deals all season long only on Uber Eats. Order Now. Learn more about your ad choices. Visit podcastchoices.com/adchoices E Wednesday 2 hr 58 min #2405 - Luis J Gomez & Big Jay Oakerson Luis J. Gomez and Big Jay Oakerson are comics and podcasters. Together, they host “Story Warz” and “Legion of Skanks” with Dave Smith. Luis also hosts “Real Ass Podcast” with Zac Amico, and Big Jay hosts “The Bonfire” on SiriusXM with Robert Kelly. Big Jay’s two-part crowdwork special, “Them/They,” is available on YouTube and vinyl, and Luis’s new special, “You’re Making This Worse,” premieres on YouTube on November 2.www.luisofskanks.comwww.youtube.com/@LuisJGomezComedywww.bigjaycomedy.comwww.youtube.com/@bigjayoakerson https://800poundgorillamedia.com/pages/bigjay  Perplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.  Don’t miss out on all the action - Download the DraftKings app today! Sign-up at https://dkng.co/rogan or with my promo code ROGAN GAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit ccpg.org (CT), or visit www.mdgamblinghelp.org (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in NH/OR/ONT. Eligibility restrictions apply. Terms: draftkings.com/sportsbook. On behalf of Boot Hill Casino & Resort (KS). Fees may apply in IL. 1 per new DraftKings customer. Must register new DraftKings account to receive reward Token. Must select Token BEFORE placing min. $5 bet to get 1 promo code to redeem complimentary 3-month NBA League Pass subscription, and max. $300 in Bonus Bets if your bet wins. Min. -500 odds req. Token and Bonus Bets are single-use and non-withdrawable. Bonus Bet expires in 7 days (168 hours) and stake removed from payout. Token expires 11/23/25. Terms: sportsbook.draftkings.com/promos. NBA League Pass: Subscription auto-renews monthly at then-current price (currently $16.99/mo); cancel anytime. Terms, restrictions, and eligibility requirements apply. Redeem League Pass by 12/19/25  This video is sponsored by BetterHelp. Visit https://BetterHelp.com/JRE Learn more about your ad choices. Visit podcastchoices.com/adchoices E Tuesday 2 hr 52 min #2404 - Elon Musk Elon Musk is a business magnate, designer, and engineer known for his work in electric vehicles, private spaceflight, and artificial intelligence. His portfolio of companies includes Tesla, SpaceX, Neuralink, X, and several others.https://x.com/elonmusk Learn more about your ad choices. Visit podcastchoices.com/adchoices E Oct 31 3 hr 18 min #2403 - Andrew Gallimore Andrew Gallimore, PhD, is a chemical pharmacologist and neurobiologist. He is one of the world’s leading experts on psychedelics and the author of several books, including his most recent, “Death by Astonishment: Confronting the Mystery of the World’s Strangest Drug.” www.buildingalienworlds.comhttps://www.youtube.com/c/alieninsecthttps://read.macmillan.com/lp/death-by-astonishment-9781250357755/  Perplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.  Visit https://squarespace.com/ROGAN to save 10% off your first purchase of a website. Learn more about your ad choices. Visit podcastchoices.com/adchoices E Oct 30 2 hr 35 min #2402 - Miranda Lambert Miranda Lambert is a country musician who performs both as a solo artist and as a member of the band Pistol Annies. Her recent releases include “A Song to Sing,” a single recorded with Chris Stapleton; “Postcards from Texas,” a solo album; and “Hell of a Holiday,” an album recorded with Pistol Annies. She’s also the author, with Holly Gleason, of the cookbook “Y’all Eat Yet? Welcome to the Pretty B*tchin’ Kitchen.” In addition, she has her own clothing line, Idyllwind, and winery, Red 55, and oversees the pet charity MuttNation.www.mirandalambert.com www.idyllwind.com www.red55winery.com www.muttnation.com  Perplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.  Go to ExpressVPN.com/ROGAN to get 4 months free!  Don’t miss out on all the action - Download the DraftKings app today! Sign-up at https://dkng.co/rogan or with my promo code ROGAN GAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit ccpg.org (CT), or visit www.mdgamblinghelp.org (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in NH/OR/ONT. Eligibility restrictions apply. Terms: draftkings.com/sportsbook. On behalf of Boot Hill Casino & Resort (KS). Fees may apply in IL. 1 per new DraftKings customer. Must register new DraftKings account to receive reward Token. Must select Token BEFORE placing min. $5 bet to get 1 promo code to redeem complimentary 3-month NBA League Pass subscription, and max. $300 in Bonus Bets if your bet wins. Min. -500 odds req. Token and Bonus Bets are single-use and non-withdrawable. Bonus Bet expires in 7 days (168 hours) and stake removed from payout. Token expires 11/23/25. Terms: sportsbook.draftkings.com/promos. NBA League Pass: Subscription auto-renews monthly at then-current price (currently $16.99/mo); cancel anytime. Terms, restrictions, and eligibility requirements apply. Redeem League Pass by 12/19/25 Learn more about your ad choices. Visit podcastchoices.com/adchoices E Oct 29 2 hr 29 min #2401 - Avi Loeb Avi Loeb, PhD, is a theoretical physicist and Frank B. Baird, Jr., Professor of Science at Harvard University. He is the author of several books, the most recent of which is \"Interstellar: The Search for Extraterrestrial Life and Our Future in the Stars.\" https://lweb.cfa.harvard.edu/~loeb/  Buy 1 Get 1 Free Trucker Hat with code ROGAN at https://happydad.com  A House of Dynamite, now streaming only on Netflix. Learn more about your ad choices. Visit podcastchoices.com/adchoices E Oct 28 2 hr 14 min #2400 - Katee Sackhoff Katee Sackhoff is an actor known for such roles as Kara \"Starbuck\" Thrace on \"Battlestar Galactica,\" Bo-Katan Kryze on \"The Mandalorian,\" and Vic Moretti on \"Longmire.\" In addition to her work on-screen, she hosts \"The Sackhoff Show\" podcast.www.kateesackhoff.comwww.youtube.com/@KateeSackhoffOfficialhttps://kidsvcancer.org/  Perplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan. Learn more about your ad choices. Visit podcastchoices.com/adchoices E Oct 25 2 hr 32 min #2399 - Daryl Davis & Jeff Schoep Daryl Davis is a blues musician, race relations expert, and author of several books, including \"The Klan Whisperer.\" Jeff Schoep led America's largest neo-Nazi organization, the National Socialist Movement, for nearly three decades before renouncing its ideology. He is the author of \"American Nazi: From Hate to Humanity.\"www.daryldavis.comwww.jeffschoep.com  Perplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.  Don’t miss out on all the action - Download the DraftKings app today! Sign-up at https://dkng.co/rogan or with my promo code ROGAN.  GAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit ccpg.org (CT), or visit www.mdgamblinghelp.org (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in NH/OR/ONT. Eligibility restrictions apply. Terms: draftkings.com/sportsbook. On behalf of Boot Hill Casino & Resort (KS). Fees may apply in IL. 1 per new customer. Must register new account to receive reward Token. Must select Token BEFORE placing min. $5 bet to receive $300 in Bonus Bets if your bet wins. Min. -500 odds req. Token and Bonus Bets are single-use and non-withdrawable. Token expires 11/23/25. Bonus Bets expire in 7 days (168 hours). Stake removed from payout. Terms: sportsbook.draftkings.com/promos. Ends 11/16/25 at 11:59 PM ET. Sponsored by DK.  This video is sponsored by BetterHelp. Visit https://BetterHelp.com/JRE Learn more about your ad choices. Visit podcastchoices.com/adchoices E Oct 23 2 hr 17 min #2398 - Francis Foster & Konstantin Kisin Francis Foster is a comic and author of \"Classroom Confidential: The Truth About Being a Teacher and Why You Should Never Become One.\" Konstantin Kisin is a political commentator and author of \"An Immigrant's Love Letter to the West.\" Together, they host the podcast \"Triggernometry.\"⁠www.francisfoster.co.uk⁠⁠www.konstantinkisin.com⁠⁠https://www.youtube.com/@triggerpod⁠  Perplexity: Download the app or ask Perplexity anything at ⁠https://pplx.ai/rogan⁠.  Get a free welcome kit with your first subscription of AG1 at ⁠https://drinkag1.com/joerogan⁠  Don’t miss out on all the action - Download the DraftKings app today! Sign-up at ⁠https://dkng.co/rogan⁠ or with my promo code ROGAN.  GAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit ⁠gamblinghelplinema.org⁠ (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit ⁠ccpg.org⁠ (CT), or visit ⁠www.mdgamblinghelp.org⁠ (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in NH/OR/ONT. Eligibility restrictions apply. Terms: ⁠draftkings.com/sportsbook⁠. On behalf of Boot Hill Casino & Resort (KS). Fees may apply in IL. 1 per new customer. Must register new account to receive reward Token. Must select Token BEFORE placing min. $5 bet to receive $300 in Bonus Bets if your bet wins. Min. -500 odds req. Token and Bonus Bets are single-use and non-withdrawable. Token expires 11/23/25. Bonus Bets expire in 7 days (168 hours). Stake removed from payout. Terms: ⁠sportsbook.draftkings.com/promos⁠. Ends 11/16/25 at 11:59 PM ET. Sponsored by DK. Learn more about your ad choices. Visit podcastchoices.com/adchoices E Oct 22 2 hr 57 min #2397 - Richard Lindzen & William Happer Richard Lindzen, PhD, is Professor Emeritus of Earth, Atmospheric, and Planetary Sciences at the Massachusetts Institute of Technology. William Happer, PhD, is Professor Emeritus of Physics at Princeton University. Doctors Lindzen and Happer are recognized for questioning prevailing assumptions about climate change and energy policy.www.co2coalition.org  Perplexity: Download the app or ask Perplexity anything at https://pplx.ai/rogan.  Buy 1 Get 1 Free Trucker Hat with code ROGAN at https://happydad.com  Try ZipRecruiter FOR FREE at https://ziprecruiter.com/rogan  Learn more about your ad choices. Visit podcastchoices.com/adchoices E Oct 21 2 hr 11 min Load more episodes More podcasts like this This Past Weekend w/ Theo Von Theo Von The Shawn Ryan Show Shawn Ryan Danny Jones Podcast Danny Jones Julian Dorey Podcast Julian Dorey JRE Clips Joe Rogan Adam Carolla Show PodcastOne / Carolla Digital Tin Foil Hat With Sam Tripoli Sam Tripoli WAR MODE War Mode Triforce! Pickaxe Home Search Your Library Premium ,",
    "Joe Rogan Experience #2255 - Mark Zuckerberg - YouTube About Press Copyright Contact us Creators Advertise Developers Terms Privacy Policy & Safety How YouTube works Test new features NFL Sunday Ticket © 2025 Google LLC",
    "Joe Rogan - Wikipedia Jump to content From Wikipedia, the free encyclopedia American podcaster and comedian (born 1967) Joe Rogan Rogan in 2017 Born Joseph James Rogan ( 1967-08-11 ) August 11, 1967 (age 58) Newark, New Jersey , U.S. Occupations Podcaster color commentator comedian actor television host Years active 1988–present Known for The Joe Rogan Experience Spouse Jessica Ditzel ​ ( m. 2009) ​ Children 3 (1 adopted) [ 1 ] Comedy career Medium Stand-up podcast television film Genres Observational comedy black comedy insult comedy cringe comedy satire Subjects American culture American politics sports current events religion pop culture recreational drug use YouTube information Channel PowerfulJRE Genre Podcasting Subscribers 20.2 million Views 6.2 billion Last updated: September 6, 2025 Website joerogan .com Joseph James Rogan Jr. (born August 11, 1967) is an American podcaster, UFC color commentator , comedian, actor, and former television host. He hosts The Joe Rogan Experience , which is one of the most popular podcasts in the world and has been the most streamed podcast on Spotify since 2020. [ 2 ] Rogan was born in Newark, New Jersey , and began his career in comedy in 1988 in the Boston area. After relocating to Los Angeles in 1994, he signed an exclusive developmental deal with Disney and appeared as an actor on several television shows, including Hardball and NewsRadio . In 1997, he started working for the UFC as an interviewer and color commentator. He released his first comedy special , I'm Gonna Be Dead Someday... , in 2000 and hosted the game show Fear Factor from 2001 to 2006. After leaving Fear Factor , Rogan focused on his stand-up career and hosted more comedy specials. He launched The Joe Rogan Experience in 2009; by 2015, it was one of the most popular podcasts in the world, regularly receiving millions of plays per episode. Spotify obtained exclusive distribution rights to The Joe Rogan Experience in 2020 for $200 million . [ 3 ] Rogan's audience has since grown significantly, and in 2024, he renewed his deal with Spotify for an estimated $250 million , but will no longer be exclusive to them. [ 4 ] Rogan has voiced support for same-sex marriage , recreational drug legalization, universal health care , universal basic income , gun rights , and free speech , while opposing cancel culture and military adventurism . Rogan has been criticized for promoting conspiracy theories , COVID-19 misinformation , and for hosting guests who spread misinformation and pseudoscience . [ 5 ] [ 6 ] Having previously endorsed Ron Paul in 2012 and Bernie Sanders in 2020 , Rogan supported Donald Trump in 2024 . He later criticized some of Trump's policies. [ 7 ] Early life and education Rogan in a 1985 yearbook Joseph James Rogan was born in Newark, New Jersey , on August 11, 1967. [ 8 ] [ 9 ] His paternal grandfather was Irish , while his three other grandparents were all of Italian descent . [ 10 ] His parents, James Joseph Rogan Sr. and Susan Lembo, divorced when he was five, [ 11 ] and he has not been in contact with his father, an architect, since he was seven. [ 12 ] He recalled, \"All I remember of my dad are these brief, violent flashes of domestic violence. But I don't want to complain about my childhood. Nothing bad ever really happened to me. I don't hate the guy.\" [ 11 ] At the age of seven, he moved with his mother to San Francisco , California, [ 11 ] and when he was 11 they moved to Gainesville, Florida . [ 13 ] They later settled in Newton Upper Falls , Massachusetts. He graduated from Newton South High School in 1985. [ 14 ] [ 15 ] [ 16 ] Rogan participated in Little League Baseball and developed an interest in martial arts in his early teens. [ 17 ] He recalled being \"terrified of being a loser\" as a child [ 18 ] and said, \"Martial arts gave me not just confidence, but also a different perspective of myself and what I was capable of. I knew that I could do something I was terrified of, and that was really difficult, and that I could excel at it. It was a big deal for me.\" [ 18 ] Martial arts were \"the first thing that ever gave me hope that I wasn't going to be a loser. So I really, really gravitated toward it\". [ 19 ] At age 14, he took up karate and started taekwondo a year later. [ 11 ] When he was 19, he won the US Open Championship taekwondo tournament as a lightweight. [ 9 ] [ 16 ] He was a Massachusetts full-contact state champion for four consecutive years and became a taekwondo instructor. [ 9 ] [ 11 ] He also practiced amateur kickboxing and held a 2–1 record; [ 20 ] he retired from competition at age 21, as he began to suffer from frequent headaches and feared he might sustain worse injuries. [ 9 ] [ 11 ] He attended the University of Massachusetts Boston but found the endeavor \"pointless\" and dropped out early. [ 11 ] Career 1988–1994: Early stand-up career I didn't have a direction until I became a stand-up comedian. I was pretty nervous about my future. I couldn't imagine myself working a 9-to-5 job. —Rogan on his career [ 21 ] Rogan had no intention of being a professional comedian. [ 22 ] [ 23 ] He was a fan of comedy from a young age saying of Richard Pryor 's special Live on the Sunset Strip , \"It affected me in such a profound way. Nothing had made me laugh like that.\" [ 9 ] His friends from gym and Taekwondo school, whom he would make laugh with impressions and jokes, convinced him to try stand-up. [ 9 ] At 21, after six months preparing material and practicing his delivery, [ 24 ] he performed his first stand-up routine on August 27, 1988, at an open-mic night at a Stitches comedy club in Boston. [ 14 ] [ 22 ] While living in Boston and working on his stand-up, Rogan held several jobs to secure himself financially. These jobs included teaching martial arts at Boston University and in nearby Revere , delivering newspapers, driving a limousine, doing construction work, and assisting a private investigator . [ 11 ] [ 14 ] Meanwhile, his blue comedy style earned him gigs at bachelor parties and strip clubs. [ 9 ] One night, he persuaded the owner of a comedy club in Boston to allow him to try a new five-minute routine. At the show was talent manager Jeff Sussman, who liked the act and offered to become his manager, which Rogan accepted. [ 9 ] [ 25 ] In 1990, Rogan moved to New York City. As a full-time comedian, he was \"scratching and grinding\" for money and stayed with his grandfather in Newark for the first six months. [ 26 ] Rogan later cited Richard Jeni , [ 27 ] Lenny Bruce , [ 28 ] Sam Kinison and Bill Hicks as comedy influences. [ 22 ] 1994–1999: Hardball and NewsRadio In 1994, Rogan relocated to Los Angeles, [ 11 ] where his first national television spot followed on the MTV comedy show Half-Hour Comedy Hour . [ 9 ] The appearance led to the network offering him a three-year exclusive contract and a role in a pilot episode of a \"dopey game show\" for $500 . Rogan declined, but it prompted Sussman to send tapes of Rogan's performances to several networks, which sparked a bidding war. [ 22 ] After a period of negotiation, Rogan accepted a development deal with the Disney network. He secured his first major acting role in the 1994 nine-episode Fox sitcom Hardball as Frank Valente, a young, egocentric star player on a professional baseball team. [ 22 ] Rogan called the hiring process \"weird\", as the network had no idea if he could act until he was asked by Dean Valentine, then-president of Walt Disney Television , to whom he replied: \"If you can lie, you can act, and if you can lie to crazy girlfriends, you can act under pressure\". [ 22 ] The filming schedule was a new experience for Rogan, who started to work 12-hour days. [ 17 ] Rogan later said: \"It was a great show on paper until a horrible executive producer with a big ego was hired by Fox to run the show and he rewrote it\". [ 22 ] Around this time, Rogan began performing at The Comedy Store in Hollywood and was hired as a paid regular by owner Mitzi Shore . According to Rogan, he performed at the club for the next 13 years for free and paid for the venue's new sound system. [ 29 ] From 1995 to 1999, Rogan starred in the NBC sitcom NewsRadio as Joe Garrelli, an electrician and handyman at the show's fictional news radio station. [ 9 ] [ 30 ] The role was originally set to be played by actor Ray Romano , but Romano was let go from the cast after one rehearsal and Rogan was brought in. [ 22 ] [ 31 ] The switch caused Rogan to work with the show's writers to help develop the character before the show was set to launch, [ 32 ] which he later described as a \"very dumbed-down, censored version\" of himself. [ 25 ] Rogan befriended fellow cast member Phil Hartman , who confided his marital problems to him. Rogan claimed he tried to persuade Hartman to divorce his wife five times, but \"he loved his kids and didn't want to leave\". In 1998, Hartman was murdered by his wife. [ 33 ] The loss affected Rogan's ability to perform stand-up, and he canceled a week of scheduled gigs. [ 34 ] Rogan later saw acting as an easy job, but grew tired of \"playing the same character every week\", [ 35 ] and only did so for the money. [ 36 ] He later viewed his time on NewsRadio as \"a dream gig\" that allowed him to earn money while working on his stand-up as often as he could. [ 22 ] [ 14 ] During the series, he worked on a pilot for a show entitled Overseas . [ 35 ] 1997–2006: UFC commentator and Fear Factor Gerald Strebendt (left) posing with Joe Rogan in a boxing ring, 2002 Rogan began working for the mixed martial arts promotion Ultimate Fighting Championship (UFC) as a backstage and post-fight interviewer. His first show took place at UFC 12: Judgement Day in Dothan, Alabama , on February 7, 1997. [ 37 ] He became interested in Brazilian jiu-jitsu in 1994 after watching Royce Gracie fight at UFC 2: No Way Out , and landed the position at the organization as Sussman was friends with its co-creator and original producer, Campbell McLaren . [ 38 ] He quit after two years as his salary could not cover the cost of traveling to the events, which were often held in rural locations. [ 39 ] After the UFC was taken over by Zuffa in 2001, Rogan attended some events and became friends with its new president Dana White , who offered him a job as a color commentator . However, Rogan initially declined as he \"just wanted to go to the fights and drink\". [ 38 ] [ 11 ] In 2002, White was able to hire Rogan for free in exchange for prime event tickets for him and his friends. [ 37 ] After about 15 free gigs as a commentator, Rogan accepted pay for the job, working alongside Mike Goldberg until the end of 2016. [ 11 ] Rogan won the Wrestling Observer Newsletter Award for Best Television Announcer twice, and was named MMA Personality of the Year four times by the World MMA Awards . [ 40 ] In 1999, Rogan secured a three-album deal with Warner Bros. Records and began tentative plans to star in his own prime-time televised sitcom on Fox named The Joe Rogan Show . [ 23 ] The show, co-written by Seinfeld writer Bill Masters, was to feature Rogan as \"a second-string sportscaster who lands a spot as the token male on a View -style women's show\". [ 25 ] In December 1999, he recorded his first stand-up comedy album in two shows at the Comedy Connection at Faneuil Hall in Boston, [ 41 ] which was released as I'm Gonna Be Dead Some Day... in August 2000. [ 9 ] [ 22 ] It received national exposure on The Howard Stern Show and downloads from Napster . [ 42 ] \"Voodoo Punanny\", a song Rogan wrote after Warner suggested to produce a song they could play on the radio, was subsequently released as a single. [ 43 ] Around this time, Rogan also worked on ideas for a film and a cartoon with his comedian friend Chris McGuire, [ 35 ] [ 22 ] and began to operate a blog on his website, JoeRogan.net, which he used to discuss various topics that helped him develop his stand-up routines. [ 36 ] In 2001, the development of Rogan's television show was interrupted after he accepted an offer from NBC to host the American edition of Fear Factor . He declined initially as he thought NBC would not air such a program due to its content, but Sussman convinced him to accept. [ 9 ] Rogan later said that the main reason he accepted was to obtain observations and anecdotes for his stand-up comedy. [ 44 ] The show increased Rogan's national exposure which caused turnouts at his stand-up gigs to grow. Fear Factor ran for an initial six seasons from 2001 to 2006. [ 45 ] Rogan's role as host of Fear Factor led to further television opportunities. In 2002, he appeared on the episode \"A Beautiful Mind\" of Just Shoot Me as Chris, the boyfriend of lead character Maya Gallo. [ 46 ] In December 2002, Rogan was the emcee for the 2002 Blockbuster Hollywood Spectacular, a Christmas parade in Hollywood. [ 47 ] In February 2003, Rogan became the new co-host of The Man Show on Comedy Central for its fifth season from August 2003, with fellow comedian Doug Stanhope , following the departure of original hosts Jimmy Kimmel and Adam Carolla . [ 48 ] [ 49 ] A year into the show, however, the hosts entered disagreements with Comedy Central and the show's producers over content. Rogan recalled: \"I was a little misled ... I was told: 'Show nudity, and we'll blur it out. Swear and we'll bleep it out.' That hasn't been the case\". [ 50 ] The show ended in 2004. Around this time Rogan entered talks to host his own radio show, but they came to nothing due to his already busy schedule. [ 50 ] 2005–2009: Comedy specials Rogan commentating for the UFC in 2006 In 2005, actor Wesley Snipes challenged Rogan to a cage fight. Rogan trained for the event for five months before Snipes backed out following an investigation by the IRS for alleged tax evasion . Rogan believed Snipes needed a quick payout to alleviate his debt. [ 51 ] After Fear Factor , Rogan focused his career on his stand-up comedy, as concentrating on television had made him feel lazy and uninspired to work on new material for his act. With the money he had earned from television, Rogan hired two people full-time to film him and his comedy friends on tour, and release clips on his website for his JoeShow web series. [ 52 ] In May 2005, Rogan signed a deal with the Endeavor Talent Agency . [ 53 ] Two months later, he filmed his second stand-up comedy special, Joe Rogan: Live , in Phoenix, Arizona . The special premiered on Showtime in 2007. [ 54 ] [ 55 ] In 2005, Rogan wrote a blog entry on his website accusing comedian Carlos Mencia of joke thievery , a claim he had made since 1993. [ 24 ] [ 56 ] [ 57 ] The situation culminated in February 2007 when Rogan confronted Mencia on stage at The Comedy Store in Hollywood. [ 58 ] A video of the incident was uploaded onto YouTube and included evidence and comments from other comedians, including George Lopez , \"The Reverend\" Bob Levy , Bobby Lee , and Ari Shaffir . [ 59 ] The incident led to Rogan's talent agent expelling him as a cli",
    "JavaScript is not available. We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using x.com. You can see a list of supported browsers in our Help Center. Help Center Terms of Service Privacy Policy Cookie Policy Imprint Ads info © 2025 X Corp. Something went wrong, but don’t fret — let’s give it another shot. Try again Some privacy related extensions may cause issues on x.com. Please disable them and try again.",
    "Joe Rogan",
    "JavaScript is not available. We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using x.com. You can see a list of supported browsers in our Help Center. Help Center Terms of Service Privacy Policy Cookie Policy Imprint Ads info © 2025 X Corp. Something went wrong, but don’t fret — let’s give it another shot. Try again Some privacy related extensions may cause issues on x.com. Please disable them and try again.",
    "Interview on \"The Joe Rogan Experience\" | The American Presidency Project Skip to main content The American Presidency Project About Search Toggle navigation Donald J. Trump (1st Term) 45th President of the United States: 2017 ‐ 2021 Interview on \"The Joe Rogan Experience\" October 25, 2024 ROGAN: All right, we're rolling. TRUMP: Let's go. ROGAN: Good to see you. Here we go. One of the things I wanted to talk to you about, I wanted to play this, but we decided we shouldn't play it because it could get copyright strike and we don't want to get the episode—We don't want anybody to have any sort of way to get it down. TRUMP: Sure. ROGAN: But it was the episode of you when you were on The Vies, and I think it was 2015 or 2016, like when you were running for President and you got introduced as, \"Our friend, Donald Trump.\" TRUMP: That's right. ROGAN: Whoopi Goldberg gives you a big hug and a kiss. Joy Behar gives you a big hug. Barbara Walters gives you a big hug. They all loved you. They were all talking about how your—you might be conservative in your financial positions, but you're very liberal socially. They were talking about you in such a favorable light. The audience was cheering and then you actually started winning in the polls and then the machine started working towards you. TRUMP: Yeah. ROGAN: But it's, there's probably no one in history that I've ever seen that's been attacked the way you've been attacked and the way they've done it so coordinated and systematically and when you see those same people in the past very favorable to you, like Oprah when you were on Oprah's Show. TRUMP: Very. ROGAN: She was encouraging you to be President. TRUMP: Last week, I did one of her last shows. I think maybe Thursday or Friday. That was a big deal being on Oprah's Show, the last one. And I was like one of the last shows in that final week and I said, \"Boy, we've come a long since that.\" ROGAN: What was it like? TRUMP: Well, the concept, it was really like two different lives. I had a very wonderful life, but I wanted to do this. The Apprentice was still going very strong. We had 12 seasons and we had actually 14 seasons, 12 years over—They had a couple of them— ROGAN: Well, they canceled the Apprentice when you were running for President, correct? TRUMP: No, they had Arnold Schwarzenegger do it. I was involved in that and I had enough of it and we did great. It was doing great, but they wanted me to stay. They all came to see me. They said, \"We're gonna give you a contract.\" They wanted to extend my contract. Mark Burnett is a great guy. Then they wanted to extend the contract. Mark said, \"You're crazy. Don't run, don't run. Nobody gives up prime time,\" they said. It's one of those little things, which is probably true for the most— ROGAN: Nobody gives up prime time though for being President? TRUMP: Well, for running against 20 some odd people. You know, turned out to be 18 professional people, mostly politicians. They said, \"Who would do this? I mean, it's a long shot.\" Actually the heads of NBC came over, Paul Telegdy, all top people came over to see me, try and talk me out of it 'cause they wanted to have me extend. The Apprentice was doing well, so it was 14 seasons, it was 12 years. We had one, two seasons where we had a double, which rarely happens. It was just a hot show, and I said, \"I want to do this.\" What happened is previously, like three years, four years before that they did a poll. They had Mitt Romney and somehow they put me in a poll and I blew everybody away. I blew him away, which isn't that hard frankly. But I blew everybody away and I said, \"That's interesting, 'cause I never really gave it that much real thought.\" I thought about it, but never real thought. But I saw these polls were very good and so I was thinking about doing it then, but I had a contract with The Apprentice, plus I was building two big buildings at the time and I wanted to make sure they got finished up properly and it was one of those things. The kids were just sort of getting involved. They're very capable kids, but they were getting involved early on. So I did that. I got them done. I had some very good successes and I came on and then I thought about it for the next one after the Romney disaster and I ran, and I won against Hillary and it was quite an experience, but it was a different life because you're right, The Vies, I was on The Vies many, many times and they loved me. ROGAN: Just the way people would talk. I mean, even if people had criticisms about you, people that didn't like you, there was always feuds and stuff like that, but the reality was the thing turned on you when they found out that you were gonna be President. It was very coordinated and some people are catching on to that now. There's a lot of people that were longtime Democrats like Elon and Bill Ackman and all these different very intelligent people. TRUMP: And they support me now. Bill Ackman— ROGAN: And they support you now. TRUMP:—supports me. ROGAN: Yes. TRUMP: He's been very supportive too. ROGAN: This is what I wanted to ask you. What was it like when you actually got in? 'Cause nobody really can prepare you for that when you're running for President, you don't really know what it's gonna be like when you actually get into office. What was, what did you think it was gonna be like? TRUMP: Do you mean in office or when I decided to run? ROGAN: No, when you got in. TRUMP: Oh, when I was. ROGAN: When you got in. TRUMP: So when I was in and won and was in The White House essentially. ROGAN: Yes. TRUMP: Well, first of all it was very surreal. It's very interesting. When I got shot, it wasn't surreal. That should have been surreal. When I was laying on the ground, I knew exactly what was going on. I knew exactly where I was hit. They were saying you were hit all over the place because there was so much blood from the ear. You would know that better than anyone. When they get the ear torn up, it's a— ROGAN: Ears bleed a lot, yeah. TRUMP: Anyway. So, and I was thinking the other day—when that happened, I really knew where I was. I knew exactly what happened. I said, I wasn't hit anywhere else. With the presidency, it was a very surreal experience, okay. ROGAN: What's day one like? You win, you get inaugurated. \"Holy shit, I'm the President.\" TRUMP: Yeah, that's what happened. So I'm driving down Pennsylvania Avenue. I had just built a building on Pennsyl—you know, the hotel, the old post office it was. We called it Trump National Hotel and we sold it to the Waldorf Astoria, and it was a wonderful thing. But I'm driving down, I'm passing the hotel. You've never seen so many motorcycles, police, military, you know, it was a major thing. I got off, really the first time I used Air Force One, landed and we're coming down and it was very beauti—I mean, it was incredible. And we're going down Pennsylvania Avenue in the opposite direction. Normally you're used to going one way and all of a sudden you're going the other way. The street was loaded up and I wanted to go out and I wanted to wave to everybody, but that wasn't smart. You know, the kids, little bit dangerous when you watch like Kennedy and some others, but I really felt, I don't know, the love was so crazy. And so I did get out of the car for a brief, you know, just for a very short walk. I thought it was very important to do. And Melania got out with a beautiful dress on that became sort of a staple. It was, uh, people loved it and Barron and we're walking down the street. But where it really got amazing, we get to The White House and now it's a little bit before dark, beautiful. And we went up to the President's quarters, they call them the Presidential quarters and I'm standing in this beautiful hallway. It's funny. Nobody ever talks about The White House as being beautiful inside. You think it's all, everything's gonna all metal doors and stuff. It's not. It's so beautiful. I made my money largely on luxury. The hallway is like 25 feet wide. The ceiling heights are, everythin—It's so beautiful. But I was standing there and I said to the guys, \"I want to see the Lincoln bedroom.\" I had never seen the Lincoln bedroom. I'd heard about the Lincoln bedroom. And I was standing with my wife. I said, \"Do you believe it? This is the Lincoln bedroom.\" I mean, it was, like, it was amazing because it's, look, if you love the country, but here you are, the Lincoln bedroom. And the bed, you know he was very tall. He was six foot six, which then would be like, like Barron. Would be like Barron Trump. He's 6'9, but six foot six, he was very tall. Then on top of that, he wore— ROGAN: There it is. TRUMP:—that. Yeah, there it is. It's a long bed, elongated bed. And because people were shorter then. You see, some of the chairs are very, very low to the ground actually. But he had the long bed and they had, uh you had the Gettysburg Address right on that, right under that. You can't see it here, but right there, the original version of the Gettysburg Address, and this is the original, and I'm looking and I just looked around. I said, \"Do you believe this?\" Because I was never a pol—First of all, even if you were a politician. But I was never a politician. I sort of just started, right. ROGAN: Right. TRUMP: And all of a sudden I'm standing in The White House. And it was uh, very very surreal. That room was so beautiful to me, much more beautiful than it actually is. You know, to me, when I looked at the bed, and the bed, you could see it was a little bit longer, had to be a little bit longer. Uh, he lost his son and the two of them suffered from melancholia. They didn't call it depression, they called it melancholia and they suffered from it. He was a very depressed guy and she was a very depressed woman, more so than him. And on top of that, they lost their son whose name was Tad. Tad. And uh, and just seeing it, and the little picture. There's a little tiny picture. I mean, you can't see the details there, little, tiny—everything the way it was—a little tiny picture of Tad who he lost, and it was devastating. And he was in a war and he was having a hard time because he couldn't beat Robert E. Lee. Robert E. Lee won like 13 battles in a row. And he was getting a phobia, like a fighter. You know a lot about the fight stuff, but like I went to a UFC fight and it was a champion who was 14 and 1 about a year ago, you would know the names, 14 and 1, and the only guy he lost to was this one guy. But the guy that he was fighting was like, almost just an average fighter. He lost numerous times, but he beat this one guy. So I said, \"Okay-\" ROGAN: I really don't know who you're talking about. I'm trying to— TRUMP: I will figure it out. ROGAN: Okay. TRUMP: But about a year ago—But the point is that he lost. He wasn't nearly the fighter as the one—But the one who was not nearly the fighter had beaten, he's the only guy that beat the champ like five years before. And then he said, \"I'll take the guy that won the other fight.\" And that's what happened. He beat him a second time. ROGAN: Sometimes psychological advantages. TRUMP: Yeah. What is this crazy thing? Lincoln had a—uh, I don't know, I've never read this. I heard it from people in The White House who really understand what was going on with the whole life of The White House. But Lincoln had the yips, about, in a way, as the golfers would say. He had a phobia about Robert E. Lee. He said, \"I can't beat Robert,\" because Robert E. Lee won many battles in a row. He was just beating the hell out of—They tried to get Robert E. Lee to be on the North, but he said, \"No, I have to be with my state.\" The state was his whole thing and he went to the South. And, he was, uh I've had generals tell me—We have some great generals. The real generals, not the ones you see on television. The ones that beat Isis, with me. We defeated Isis in record time. It was supposed to take years and we did it in a matter of weeks. These are great generals. These are tough guys. These are not woke guys. But their favorite general in terms of genius was Robert E. Lee. He took a war— ROGAN: In terms of strategy, you mean? TRUMP: Strategically. He took a war that should have been over in a few days and it was, you know, years of hell, a vicious war. And so here I am standing there, and again, I had never really done this before. I ran, I ran a number of months before I won. I probably, uh, I guess if you figured, max it out, it would be a year, something like that. So I had never run for office. And I did well. I mean I, I went into debates. We had 18 people including me, and then slowly but surely they started to disappear. We had debates, good debates. ROGAN: Everyone's aware of all this stuff. But what I want to get to is what was the experience once you got inside? TRUMP: It was just— ROGAN: Like, what did you think it was gonna be like in terms of your ability to govern? This is your first experience governing anything. You've never been a governor, you've never been a mayor— TRUMP: Yeah. ROGAN: Right. TRUMP: Private stuff. ROGAN: Business. TRUMP: Yeah. ROGAN: But now all of a sudden you're inside The White House. TRUMP: The biggest thing was just that first moment of being in this hallowed—It was really a hallowed place to me. It was— ROGAN: Surreal. TRUMP:—beyond—To me, that was the experience. It was a surreal experience. And then with time that wears off. With time, it becomes your place where you stay. ROGAN: Right. TRUMP: And I was doing a lot of—I had two things that I really focused on, governing the country and survival. Because from the moment I won, before I got to office, all of a sudden—I mean, they came down. I mean, nobody has ever been treated that way. And, and you see that, I mean, you see we're in The Washington Post very early on. They said, \"Well now the impeachment stuff starts.\" And it did. I mean it literally started from the beginning. So I had survival and run the nation. I had a combination. Most people don't have the survival, they get in. ROGAN: What did you expect though, in terms of once you got inside you had to appoint all these people? How many appointments did you have to make with a very short amount of time? TRUMP: You have actually 10,000 appointments. Now, they're different. You have big ones and then they appoint 100 people and 200 people. But the President really is involved with approximately 10,000 appointments. So you'll appoint a Secretary of State and he, he or she will appoint a lot of people. So it's a lot. But in terms of major ones, you probably have like 100, but they're big ones. Treasury, State, military. ROGAN: And how did you know who to appoint? TRUMP: Well, I didn't. I had no experience— ROGAN: You didn't. TRUMP: You have to understand, Joe— ROGAN: Right. So are you going— TRUMP: I was there 17 times in Washington and I never stayed over. According to the press, which I think is probably right. Over the years I was only there 17 times. I never staye",
    "Joe Rogan Has Built His Career on Anti-Science Misinformation. I Should Know Because I Was On the Receiving End Donate About The ProSocial Process Our Impact Research Iniatives Stories of Change Get Involved Courses Community Events Resources Magazine Special Editions Journal Podcast Donate Lang. January 21, 2022 Joe Rogan Has Built His Career on Anti-Science Misinformation. I Should Know Because I Was On the Receiving End Joe Rogan is one example of a wider problem in our age of misinformation. Alison A. Elgart Earlier this week, an open letter signed by 270 doctors and health professionals called on Spotify to establish clear rules on their platform regarding misinformation due to Joe Rogan's lies and baseless conspiracy theories about COVID-19. With the spotlight on Rogan's anti-science rhetoric, an article in Futurism magazine furnished an audio clip in which Joe Rogan was caught yelling at a female scientist. You might presume that this occurred last week on the âJoe Rogan Experienceâ podcast, and he was belittling a scientist about vaccines. You would be wrong because I am the scientist and the year was 2006. I have known about the sexist and anti-science tendencies of Rogan for a long time. In my experience with Rogan, he acted much like the common chimpanzees to which he was referring. At the time, he was the host of âFear Factorâ and appeared as a guest on the âOpie and Anthonyâ radio show. While listening to the show, I heard him spout out a number of completely false statements about giant hybrid gorilla-chimpanzees who killed lions, always walked upright, and lived terrestrially. These apes, apparently a popular source of myth, are known as Bili Apes or Bondo Apes. Having dabbled in cryptozoology, I was familiar with these stories and also knew that they are entirely fictional. As an educator, I felt compelled to call in to the show and present my perspective. I got one sentence out before I was screamed at, cursed at, demeaned, and reduced to a âvagina.â Whereas most of Roganâs rhetoric, in this case, can only be described as blustering-idiot-thinks-that-he-is an-animal-expert, he did get one fact right: Our DNA is approximately 99% identical to that of chimpanzees. Rogan demonstrates our common ancestry in his treatment of me in this radio segment. The common ancestor that we shared with chimps was probably aggressive, hierarchical, and male-dominated. I dared to point out Roganâs inability to critically analyze information that he found on the internet, and his only recourse was to aggressively attack me. He would not even let me speak. It is clear that I struck a nerve being a woman -- and an educated one, in particular, who challenged him. One can hear how agitated he became when I laughed at his response to me. He found it necessary to further exert his male dominance. In wild Ugandan chimpanzees, it was found that aggressive screams were made mainly by low-ranking males, females, and juveniles (Slocombe and Zuberbuhler, 2005). No wonder Rogan is so fascinated by these animals. He is still talking about these chimpanzees! I found a clip from his show in 2019 in which he relays the same myths. What is interesting about this clip is that he has a calm interaction with the male guest about the topic. Of course, the male does not challenge his assertions. Rogan was completely unnerved or unimpressed with my credentials. What my 25 years of schooling (too much? well, you decide) culminating in a Ph.D. have taught me is that sources of information are important. Media literacy is sorely lacking among the greater population. One can find an untold number of popular websites regurgitating the information that Rogan passed off as fact. Published (i.e., scientifically valid) work on these apes has demonstrated that they are âbehaviorally and morphologically typical chimpsâ (Hicks 10:2010). One actual fact that is interesting about these chimpanzees is that they sometimes eat estivating fish. Peer-reviewed, published studies from trained experts must be the source of our knowledge. Rogan is, of course, only an example of a wider problem. I do not know if we can pinpoint the year that the American public grew more anti-scientific but the timing must correlate with the rise of an open, expansive, and available internet. In The Seventh Sense by Joshua Cooper Ramo, he details the new age of networks that we have entered. Old hierarchies have been dissolved. Who needs scientists and doctors telling us what to think and how to treat maladies? The knowledge is freely available! Anyone, such as Joe Rogan, can be an animal âexpertâ now. Sadly, this state of affairs has brought us to the age of misinformation, âfake news,â and incivility, as there is no respect for those who have spent their lives becoming educated. I try to do my part to equip this generation with the tools to be discerning in what they accept as truth versus fiction. In all of the courses that I teach, I emphasize critical thinking and research skills. We are bombarded with so much information now that it seems we have to process it with supersonic speed. As an evolutionary anthropologist, I wonder how our brains will adapt to the ever-increasing speed of our world. Will all adapt, or will we have a new ignorant caste, easily led by fake news? The amount of disinformation out there will continue to increase and as a society, we will be faced with difficult choices. Do we keep the information open and accessible or do we need more gatekeeping, as Ramos discusses? Perpetuating myths about chimpanzees is one thing, but during the pandemic, the anti-science rhetoric and misinformation is literally killing people. I keep hoping that we will have our Sputnik moment as a society, but if a pandemic is not a wake-up call, I donât know what will be. In the end, will the chimpanzees look like the more intelligent beings? References: Cooper Ramo, Joshua (2016) The Seventh Sense . New York: Back Bay Books, Little Brown and Co. Hicks, T. C. (2010). A chimpanzee Mega-Culture? Exploring behavioral continuity in Pan troglodytes schweinfurthii across northern DR Congo. University of Amsterdam. UvA-DARE. Slocombe, Katie E. and Klaus Zuberbuhler (2005) Agonistic screams in wild chimpanzees ( Pan troglodytes schweinfurthii ) vary as a function of social role. Journal of Comparative Psychology . 119:67-77. Article Podcast Categories: Commentaries tags: No items found. For More: No items found. Series: No items found. Share this post: Related Posts No items found. More from This View of Life Get in Touch hello@prosocial.world Subscribe to our newsletter Sign up for ProSocial news and exclusive insights First Name Last Name Email Address Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Refund Policy | Terms & Conditions | Privacy Policy | Cookie Settings Â© 2025 ProSocial World Website made possible by a grant from the John Templeton Foundation Website designed by Iris Cocreative Alison A. Elgart"
  ],
  "links": [
    "https://www.joerogan.com/",
    "https://www.instagram.com/joerogan/?hl=en",
    "https://open.spotify.com/show/4rOoJ6Egrf8K2IrywzwOMk",
    "https://www.youtube.com/watch?v=7k1ehaE0bdU",
    "https://en.wikipedia.org/wiki/Joe_Rogan",
    "https://x.com/joerogan",
    "https://www.facebook.com/JOEROGAN/",
    "https://x.com/joerogan/status/1851118464447971595?lang=en",
    "https://www.presidency.ucsb.edu/documents/interview-the-joe-rogan-experience",
    "https://www.prosocial.world/posts/joe-rogan-has-built-his-career-on-anti-science-misinformation"
  ]
}