{
  "query": "Michelle Tandler",
  "rendered_query": "\"Michelle Tandler\"",
  "total_results": 10,
  "texts": [
    "JavaScript is not available. We’ve detected that JavaScript is disabled in this browser. Please enable JavaScript or switch to a supported browser to continue using x.com. You can see a list of supported browsers in our Help Center. Help Center Terms of Service Privacy Policy Cookie Policy Imprint Ads info © 2025 X Corp. Something went wrong, but don’t fret — let’s give it another shot. Try again Some privacy related extensions may cause issues on x.com. Please disable them and try again.",
    "",
    "Michelle Tandler (@mtandler) • Instagram photos and videos",
    "Michelle Tandler, C’08 | Penn Arts & Sciences at Work Michelle Tandler, C’08 Category Manager, Thumbtack San Francisco Intellectual History Major Over the course of my career I have often found myself thinking “I have no idea what I want to do next. I have no long-term plan.” Whether it was during my senior year in college or four years later at Microsoft, I kept wondering, “Where is this leading?” I’m a decade out of school, and I think this is the first time that I can see a vision of what 10 years out looks like. I’m in a role that feels like a true fit. It’s a really neat feeling, but it took me a long time to get here. I’m in a role that feels like a true fit. It’s a really neat feeling, but it took me a long time to get here. I think my senior-year self would have seen what I’m doing now as being consistent with the intellectual passions I developed while at Penn. I studied Intellectual History which focuses quite a bit on how society’s ideas and ideals progress and change over time. My first semester at Penn I took 17th Century Intellectual History with Professor Alan Kors. We started the course by learning about a world in which most people were illiterate, mass famine was the norm, and individuals were put on trial for asserting that the world was not flat. The invention of the printing press changed everything; people had access to knowledge in a way that had never existed before, the pace of scientific discovery sped up exponentially, and the quality of human life changed dramatically within just a few short decades. The world has never been the same since, and I continue to be enthralled with the power that technology can have to change human lives. I think my senior year self would have been inspired to know I would be working on a high tech marketplace that connects individuals with one another to do work and get things done in a way that has never existed before. That is the kind of step change that makes history. — May 10, 2018 • Photo by Loraine Terrell Share this story: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to share on LinkedIn (Opens in new window) LinkedIn",
    "Michelle Tandler | Substack Home Subscriptions Chat Activity Explore Profile Create Michelle Tandler @mtandler Lifelong San Franciscan. Aspiring New Yorker. Michelle's Substack @michelletandler 729 subscribers Subscribe Message Activity Posts Likes Reads (32) Get app This site requires JavaScript to run correctly. Please turn on JavaScript or unblock scripts",
    "Michelle Tandler | New York Post Erika Kirk is right: It is beautiful — and empowering — to be your husband's helper September 23, 2025 | 6:00am Her words felt like a revelation.",
    "Reddit - The heart of the internet Skip to main content Go to sanfrancisco r/sanfrancisco r/sanfrancisco Cold summers, thick fog, and beautiful views. Welcome to the subreddit for the gorgeous City by the Bay! San Francisco, California, USA. Members • smw2102 日本語 Magyar Bahasa Melayu Português (Portugal) Español (Latinoamérica) [Michelle Tandler] Downtown San Francisco is in trouble - and it holds serious ramifications for the city & region. Some stats: + 24% of office space is vacant (20M sq ft) + 85% decrease in convention attendees + 76% decrease in BART rides twitter.com Open Archived post. New comments cannot be posted and votes cannot be cast. Share Top Posts Reddit reReddit: Top posts of June 14, 2022 Reddit reReddit: Top posts of June 2022 Reddit reReddit: Top posts of 2022 Reddit Rules Privacy Policy User Agreement Accessibility Reddit, Inc. © 2025. All rights reserved. Expand Navigation Collapse Navigation",
    "David Sacks-backed Michelle Tandler shutters another business Dyslexic Font Typeface against dyslexia If you’re unfamiliar with Michelle Tandler, consider yourself lucky. The VC-funded mouthpiece has made herself a thorn in the side of many in San Francisco by pushing for a consistent string of recall elections and spewing wild absurdities on Twitter. These include claims that “dogs are getting addicted to meth-laced feces” to push a pro-conservative, pro-VC narrative. For what it’s worth, methamphetamine is almost exclusively eliminated through urination, not defecation. Now, unfortunately, her latest business, Growth Path Labs, has failed. So, what exactly was Growth Path Labs? Apparently, it was “an audio-first learning company that provides audio courses for professional growth.” Sound vague? It was. The company, which launched in March 2022, has released roughly a podcast a month and a handful of articles. It’s unclear how much she raised for this “company.” David Sacks ties Tandler’s last venture, Life School , was funded by David Sacks’ Craft Ventures . The startup “taught people one new skill at a time by deeply researching topics… and summarizing them in two minutes.” Some of the deeply researched topics covered include how to boil water, how to make tea, how to season water, and how to boil vegetables. Tandler brought attention to herself and her company on April 9 when she posted a tweet that seemed to imply that bringing public hangings back to San Francisco would dramatically reduce crime in the city. To defend her argument, the founder pointed out that countries such as Egypt, India, and Japan still allow hangings. Our society seems to have become seriously complacent. 100 years ago in SF people were publicly hung for their crimes. Often by vigilante groups that wanted to send a message. The hangings worked. Crime would plummet after a few of them. Often for many months at a time. — Michelle Tandler (@michelletandler) April 9, 2023 Read more: Blame the Fed: David Sacks and the VC who cried bank-run Wrong place, wrong time, wrong business The two could be unrelated, but the fact that her business shuttered a mere week after she disgustingly suggested that public lynchings were maybe a good thing is funny timing . So, what does the entrepreneur plan on doing next? Well, the genius took to Twitter to ask the platform in a now-completed poll. The options included starting a podcast, launching a media company, or getting a job. While most people voted for Tandler to get a job, the wealthy San Francisco-based Karen seems to have decided everyone actually wants her to start a podcast . She has no idea what the podcast will be about yet. Got a tip? Send us an email or ProtonMail . For more informed news, follow us on Twitter , Instagram , Bluesky , and Google News , or subscribe to our YouTube channel. We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. Settings ACCEPT Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT Share This Reddit Telegram LinkedIn Share on Mastodon Enter your Mastodon instance URL (optional) Share",
    "Michelle Tandler – Medium Sitemap Open in app Sign up Sign in Medium Logo Write Search Sign up Sign in Michelle Tandler 1.92K followers Apps & Hacks from A to Z: 26 Tools to Boost Your Productivity in 2017 Love and work… Work and love. That’s all there is. Jan 17, 2017 A response icon 7 Jan 17, 2017 A response icon 7 A SaaSy Holiday Wishlist for Office Happiness in 2017 Friends, the holiday season is upon us, and while you may be busy scheming for your upcoming vacation or holiday party schedule, your IT… Dec 14, 2016 Dec 14, 2016 Published in ThinkGrowth.org 10 Reasons to Meet With a VC Associate A lot of founders these days are being coached to avoid meeting with associates. Articles like these encourage founders to only meet with… Oct 11, 2016 A response icon 17 Oct 11, 2016 A response icon 17 Mobilize: 5 Reasons We Fell in ♥︎ With This Next-Gen Group Communication Platform Today, Trinity Ventures announced its investment in Mobilize, an enterprise-grade communication platform focused on group messaging. I’ve… Sep 21, 2016 Sep 21, 2016 Five Predictions for The Big Five in Social Evidently Snapchat is eclipsing Instagram. I’m not surprised — it’s so much more engaging and entertaining. Anecdotally, I’ve seen a surge… Apr 14, 2016 A response icon 1 Apr 14, 2016 A response icon 1 Great Expectations for Social in 2016 & Beyond (Part 1) A lot of people these days are calling the end of social media. They cite the noise factor (too many apps!) and the universal rule of the… Feb 19, 2016 A response icon 3 Feb 19, 2016 A response icon 3 Why I think Meerkat is the Next Snapchat “The power of live video is in the feelings of drama, anticipation, uncertainty, this unfiltered intimacy that we have with the audience” … Mar 12, 2015 Mar 12, 2015 How I Read Blogs Some tips, tricks and suggestions for keeping posted and amused in the blogosphere. Jan 13, 2015 A response icon 1 Jan 13, 2015 A response icon 1 A few things I’ve learned about sourcing deals as a Summer Associate in VC When I interviewed with Trinity Ventures last fall we discussed that a primary responsibility over the summer would be sourcing deals (e.g… Aug 1, 2014 Aug 1, 2014 Michelle Tandler 1.92K followers Category Manager at Thumbtack. Formerly @Trinity @Yammer & @McKinsey. SF-native. Will always leave my ❤ here. Following Brendan Connellan Gil Dibner Sarah Persitz Supervisor Matt Haney Instawork See all (1,342) Help Status About Careers Press Blog Privacy Rules Terms Text to speech",
    "TikTok - Make Your Day"
  ],
  "links": [
    "https://x.com/michelletandler?lang=en",
    "https://www.linkedin.com/in/michelletandler",
    "https://www.instagram.com/mtandler/?hl=en",
    "https://web.sas.upenn.edu/at-work/tandler/",
    "https://substack.com/@mtandler",
    "https://nypost.com/author/michelle-tandler/",
    "https://www.reddit.com/r/sanfrancisco/comments/vbsaje/michelle_tandler_downtown_san_francisco_is_in/",
    "https://protos.com/david-sacks-backed-michelle-tandler-shutters-another-business/",
    "https://medium.com/@michelletandler",
    "https://www.tiktok.com/@mtandler?lang=en"
  ]
}