{
  "query": "Paul Varga",
  "rendered_query": "\"Paul Varga\"",
  "total_results": 10,
  "texts": [
    "Staff Directory • Paul Varga Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Home Staff Directory Paul Varga Solid Waste and Recycling Title: Communications Manager Phone: 301-600-7405 Return to Staff Directory Live Edit Jobs FCG TV Maps Permits & Inspections Transit FCG FixIt Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow",
    "Paul Varga  Â· Venture Partner Â· Calm/Storm Ventures Paul Varga Venture Partner No items found. No items found. Paul has been part of the Calm/Storm journey for many years as a Supporting Partner and officially joins the team to support our Austrian portfolio. A well-known figure in the Austrian startup ecosystem, Paul co-founded Playbrush, a pioneer in Smart Toothbrushes and Oral-Care-as-a-Service, which he successfully exited in 2021. The company continues to scale internationally. Beyond building companies, Paul has been sharing his expertise by lecturing on Consumer and Retail Technology at the University of Cambridge and University College London. He also brings several years of hands-on experience in early-stage investing. Vienna-based and a proud father of two, Paul enjoys reading both about innovation and fiction. Back to team members Get in touch Submit your pitch Newsletter About us Team News Jobs Our ecosystem Founders Portfolio Partners Co-Investors Storm Days Media Podcast Blog Book FemTech Report Â© Calm/Storm Ventures 2024 Legal Notice",
    "",
    "In Memory of Fr. Paul Varga, OFM Conv. - St. Peter Church - Pt Pleasant Beach, NJ In Memory of Fr. Paul Varga, OFM Conv. Home Events & News & Live October 8 , 2025 FR. PAUL VARGA, OFM CONV. 1936-2025 Fr. Paul (Stephen) Varga, OFM Conv., a Franciscan Friar of the Our Lady of the Angels Province, died peacefully on Tuesday, October 7, 2025 in Brick Township, NJ.  Born in Trenton on December 1, 1936, he was son of the late Stephen and Catherine ( nee Chmielewski ) Varga, and brother to Kathy, Michael, and the late + Joseph.  He was the proud uncle of Joseph Varga, Jr., Joseph Manfredo, Jr., Kara Valentino, and Paul Varga, along with several grand-nieces and nephews and cousins. A graduate of Trenton Catholic, he attended St. Francis College Seminary in Staten Island. He entered the Novitiate of the Conventual Franciscans in Middleburgh, NY, professing first vows on August 12, 1957.  He professed solemn vows on October 11, 1960, while completing theological studies at St. Anthony-on-Hudson in Rensselaer, NY.  He was ordained to the priesthood on May 25, 1963. Fr. Paul’s first assignment was at Canevin High School in Pittsburgh, PA, where he taught from 1963-69.  He then began a lengthy ministry in the parochial apostolate, serving at the following parishes: St. Raphael in Burlington, Ontario (1969-72); St. Augustine of Canterbury in St. Bruno, Quebec and St. Clare in Longueuil, Quebec (1972-88); St. John the Apostle in Kingston, Ontario (1988-89); St. Peter in Riverside, NJ (1989-91). He then spent time back in Burlington, Ontario and then in Syracuse.  In 1999, Fr. Paul began a six-year assignment as Chaplain to McAuley Hall in S. Plainfield, NJ.  A true Jersey Boy, Fr. Paul’s last parochial assignment was at St. Peter in Pt. Pleasant Beach, where he served as Parochial Vicar until his health declined.  At that time, Fr. Paul entered Crest Pointe Rehabilitation and Healthcare Center, where he remained until his death. Visitation will be held Friday, October 10 from 9:30 a.m. - 10:30 a.m. at St. Peter Church (406 Forman Avenue, Point Pleasant Beach, NJ 08742).  A Mass of Christian Burial will be celebrated at St. Peter’s on Friday, October 10 at 11:00 a.m. Internment will follow in Our Lady of Lourdes Cemetery, Trenton.  In lieu of flowers, memorial donations can be made to the Franciscan Education Fund (12300 Folly Quarter Road, Ellicott City MD 21042).",
    "Paul Varga (@paulanthonyvarga) • Instagram photos and videos",
    "Paul Varga | Gatton College of Business and Economics Skip to main University of Kentucky University-wide Navigation My UK Search our Site search Search Paul C. Varga Education Information: BBA, Finance '85 Paul C. Varga is CEO of Brown-Forman Corporation, which for 150 years has built internationally known beverage alcohol brands including Woodford Reserve, Jack Daniel’s Tennessee Whiskey, Finlandia, and many others. Prior to becoming CEO, Mr. Varga served as president and chief executive officer of the company’s Brown-Forman Beverages subsidiary. He began his career at Brown-Forman as a summer intern in May 1986. He was promoted to a variety of positions within the corporation, ranging from on-premise marketing to managing the Jack Daniel’s brand. He was named senior vice president, chief marketing officer in November 2000. He earned his B.B.A. in finance from the University of Kentucky and his M.B.A. from Purdue University. Gatton College of Business and Economics 550 South Limestone Lexington, KY 40506-0034 United States (859) 257-8936 Contact Us Visit Us Make a Gift Faculty & Staff myGatton Stay Connected University of Kentucky Homepage A link to return to the University of Kentucky Homepage An Equal Opportunity University Accreditation Directory Email Privacy Policy Accessibility Disclosures © University of Kentucky Lexington, Kentucky 40506",
    "Brown-Forman Announces Leadership Succession Plan (May 29, 2018) | Brown Forman Skip to main content Louisville, KY – Brown‑Forman Corporation (NYSE: BFA, BFB) announced today that after a distinguished 31 years of service at the company, Chief Executive Officer Paul C. Varga has decided to retire, effective December 31, 2018. Varga will be succeeded by Lawson E. Whiting, unanimously approved by the Board of Directors. Whiting, a 21-year veteran of the company who currently serves as EVP and Chief Operating Officer, will become the tenth executive leader of Brown‑Forman, since its founding in 1870 by George Garvin Brown. Varga began his CEO tenure in 2003 overseeing the company’s beverage business and succeeded Owsley Brown II as the corporation’s CEO in 2005. During his time leading the company, Varga focused Brown‑Forman’s business on its premium spirits portfolio, significantly expanded the company’s global presence, initiated meaningful brand innovations, expertly deployed capital, and championed the company’s corporate responsibility and diversity and inclusion agendas. His leadership resulted in Brown‑Forman enjoying some of the highest and most consistent growth rates in the distilled spirits industry over this time horizon. Most notably, the company’s total shareholder return (TSR) during his leadership tenure to date has been 17%, propelled by an almost six-fold increase in the company’s market capitalization, which today approximates $28 billion. Varga will remain on the Brown‑Forman Board of Directors. George Garvin Brown IV, chairman of the board since 2007, thanked Varga for his leadership. “On behalf of our Board of Directors, the employees, and all Brown‑Forman shareholders, I would like to express my gratitude to Paul for leading the extended Brown‑Forman community for the last 15 years. Paul entered the leadership ranks at a time when the future of American Whiskey was in doubt, even in the United States. He will retire having successfully grown the Jack Daniel’s franchise into one of the most valuable spirits trademarks in the world. His transformation of our portfolio, coupled with his multi-year execution of balanced shareholder-friendly capital deployment, marks his tenure as arguably the most successful CEO in our industry’s modern era.” Varga stated, “It has been a privilege to serve Brown‑Forman over the last three decades. In determining the best time to implement the final piece of this succession plan, I naturally considered the readiness of the company to navigate a leadership transition such as this, and now is the right time. Also, having worked with Lawson over the last two decades, I believe, and the Board has concluded, that he is ideally suited and very well prepared to succeed as Brown‑Forman’s next CEO.” Whiting, who is 49, began his career with the company in corporate development and investor relations. Since then he has held several leadership positions, taking on assignments in finance, marketing and commercial functions in the United States and in Europe. Prior to his current role, Whiting served as EVP and Chief Brands and Strategy Officer (2015 to 2017), during which time he was responsible for re-shaping Brown‑Forman’s portfolio, including the acquisition of the BenRiach company in Scotland, the launch of Slane Irish Whiskey, and the significant investments in Woodford Reserve and Old Forester bourbon brands. Previously he was SVP and Chief Brands Officer (2013 to 2015) and SVP and Managing Director for Western Europe (2011 to 2013). Whiting earned a B.A. from Miami University and a M.B.A. from The University of Chicago’s Graduate School of Business. Commenting on Whiting’s appointment, Brown said, “The Board, and in particular its Governance & Nominating Committee led by Lead Independent Director John Cook, have been working on succession planning with Paul since his earliest days as CEO, more than 10 years ago. Looking ahead, we believe that in Lawson we have another Brown‑Forman leader with the strength of character and the intellectual rigor that is uniquely well-suited to lead our independent culture and our teams in balanced long-term thinking and global brand building. He is the right leader to help Brown‑Forman seize the enormous global opportunities that lie ahead of us for many years to come.” “I am honored and excited to become Brown‑Forman’s next CEO,” said Whiting. “I am taking on this responsibility at a time when the company is performing very well thanks to Paul, my colleagues across the company, and the support of the Brown family and the Board of Directors. We will continue to focus on the premium American Whiskey category and further strengthen our super-premium brand portfolio, as well as develop our people around the world. I look forward to leading Brown‑Forman into its next generation of growth.” This press release contains statements, estimates, and projections that are “forward-looking statements” as defined under U.S. federal securities laws. Words such as “aim,” “anticipate,” “aspire,” “believe,” “continue,” “could,” “envision,” “estimate,” “expect,” “expectation,” “intend,” “may,” “plan,” “potential,” “project,” “pursue,” “see,” “seek,” “should,” “will,” and similar words identify forward-looking statements, which speak only as of the date we make them. Except as required by law, we do not intend to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise. By their nature, forward-looking statements involve risks, uncertainties and other factors (many beyond our control) that could cause our actual results to differ materially from our historical experience or from our current expectations or projections. These risks and uncertainties include, but are not limited to: Unfavorable global or regional economic conditions, and related low consumer confidence, high unemployment, weak credit or capital markets, budget deficits, burdensome government debt, austerity measures, higher interest rates, higher taxes, political instability, higher inflation, deflation, lower returns on pension assets, or lower discount rates for pension obligations Risks associated with being a U.S.-based company with global operations, including commercial, political and financial risks; local labor policies and conditions; protectionist trade policies or economic or trade sanctions; compliance with local trade practices and other regulations, including anti-corruption laws; terrorism; and health pandemics Fluctuations in foreign currency exchange rates, particularly a stronger U.S. dollar Changes in laws, regulations, or policies – especially those that affect the production, importation, marketing, labeling, pricing, distribution, sale, or consumption of our beverage alcohol products Tax rate changes (including excise, sales, VAT, tariffs, duties, corporate, individual income, dividends, capital gains) or changes in related reserves, changes in tax rules (for example, LIFO, foreign income deferral, U.S. manufacturing and other deductions) or accounting standards, and the unpredictability and suddenness with which they can occur Dependence upon the continued growth of the Jack Daniel’s family of brands Changes in consumer preferences, consumption or purchase patterns – particularly away from larger producers in favor of smaller distilleries or local producers, or away from brown spirits, our premium products, or spirits generally, and our ability to anticipate or react to them; bar, restaurant, travel or other on-premise declines; shifts in demographic trends; unfavorable consumer reaction to new products, line extensions, package changes, product reformulations, or other product innovation Decline in the social acceptability of beverage alcohol products in significant markets Production facility, aging warehouse or supply chain disruption Imprecision in supply/demand forecasting Higher costs, lower quality or unavailability of energy, water, raw materials, product ingredients, labor or finished goods Route-to-consumer changes that affect the timing of our sales, temporarily disrupt the marketing or sale of our products, or result in higher implementation-related or fixed costs Inventory fluctuations in our products by distributors, wholesalers, or retailers Competitors’ consolidation or other competitive activities, such as pricing actions (including price reductions, promotions, discounting, couponing or free goods), marketing, category expansion, product introductions, or entry or expansion in our geographic markets or distribution networks Risks associated with acquisitions, dispositions, business partnerships or investments – such as acquisition integration, termination difficulties or costs, or impairment in recorded value Inadequate protection of our intellectual property rights Product recalls or other product liability claims; product counterfeiting, tampering, contamination, or product quality issues Significant legal disputes and proceedings; government investigations (particularly of industry or company business, trade or marketing practices) Failure or breach of key information technology systems Negative publicity related to our company, brands, marketing, personnel, operations, business performance or prospects Failure to attract or retain key executive or employee talent Our status as a family “controlled company” under New York Stock Exchange rules For further information on these and other risks, please refer to the “Risk Factors” section of our annual report on Form 10-K and quarterly reports on Form 10-Q filed with the SEC. More from the Newsroom Brown–Forman Declares Cash Dividend Brown–Forman’s Board of Directors declared a regular quarterly cash dividend of 15 4/5 cents per share on its Class A and Class B Common Stock. Brown–Forman Announces $600 Million Debt Offering Brown–Forman Corporation today announced the pricing of a $300 million 7-year senior unsecured note and a $300 million 20-year senior unsecured note. Brown–Forman Invests in Renewable Energy Brown‑Forman Corporation today announced a major commitment to renewable energy with an agreement to purchase 30 megawatts (MW) of electricity annually. Brown–Forman’s Fourth Quarter Earnings Release and Conference Call Scheduled for June 6, 2018 Brown–Forman Corporation will release its financial results for the fourth quarter and full fiscal 2018 year on June 6, 2018. Visit our Newsroom",
    "PAUL VARGA Obituary (2017) - Independence, OH - Cleveland.com <iframe src=\"//www.googletagmanager.com/ns.html?id=GTM-TDQHZW\" height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe> Search by Name Add a Memory Send Flowers Make a Donation Share Obituary Sign the Guest Book Send Flowers Share VARGA / PAUL VARGA VARGA / PAUL VARGA PAUL JOHN VARGA Send Flowers Follow Share PAUL VARGA Obituary Cherished husband of Anna Marie (nee Zoretich). Loving father of Tonya Hovanec (Dave) and Paul Jr. (Rebecca). Dearest grandfather of Jacob, Jonathan and Joshua Hovanec and Everett Varga. Dear brother of Mary Ann Soderquist and Joyce Newell. Special brother in law, uncle and friend to many. U.S. Army Veteran. Friends may call at the VODRAZKA FUNERAL HOME 6505 BRECKSVILLE RD INDEPENDENCE (Rt 21 South of Rockside) MONDAY FROM 3-8 P.M. All members of the Buckeye Rd. American Legion Post 559 and Auxillary please report to the funeral home at 5p.m. Monday to pay respects. All funeral services will be held Tuesday February 21, 2017 at 10a.m. at the First Hungarian Reformed Church 14530 Alexander Rd Walton Hills. Interment Sunset Memorial Park To plant trees in memory, please visit the Sympathy Store . Published by Cleveland.com from Feb. 18 to Feb. 19, 2017. Sign the Guest Book Memories and Condolences for PAUL VARGA Sponsored by The Family . Expand the Memories and Condolences form. Not sure what to say? Submit Your Message How do you know PAUL JOHN VARGA? (Optional) Family Friend Work School Other From Your Email (will not be displayed) Get email updates for this page Submit Your Message 15 Entries Order Digital Guest Book Rob Miller February 27, 2017 Dear Varga Family, Please accept my sincere condolences for Paul's passing.  Paul was a good neighbor who always took time to say hello and engage me in conversation  over the years. I will miss him. February 21, 2017 Dear Mrs. Varga, Tonya and family. We are so sorry for your loss and feel your pain at this time too. We are praying for strength  for your family during this hard time and the hope only God can give. May God up hold all of you during these days. Bryan & Pam Abend   (Hickory Ridge Elementary ) Barbara Toth Arnosky February 20, 2017 Paul and I were friends from Mt Auburn elementary. Joe and i were happy to visit with Paul and Ann Marie at John Adams reunion when Joe was still well.  We lost one of our forever friends. My parents Bill and Betty Toth were friends with Paul's parents when we were kids. So sad  for family. Susan Hartman-Dean February 20, 2017 Dear Mrs. Varga and family, We are so sorry for your loss.  Our childhood memories will always be cherished with the time spent with your family.  He will never be forgotten. With love and sympathy, Mark Ciarlariello February 20, 2017 Paul, I'm so sorry for your loss. I know your father was a great dad and I could see how much he loved you and his family. I pray that you will have the strength you need to get through this very difficult time. My thoughts and prayers are with you and your wonderful family. Please let me know if there is anything I can do. Mark Ciarlariello Judy Revak February 20, 2017 R.I.P. Andrew & Jan Tajgiszer February 20, 2017 God be with you till we meet again. You were a dear friend.If the Varga family needs anything I am a phone away. Jenny Zoretich Sent Flowers Send Flowers George Palgut February 19, 2017 Dear Varga Family: We are sorry to hear of Paul's passing. We hope that all of the wonderful memories you have of Paul will help you through this difficult time. Paul was a long time member. The John Adams High School Men's Alumni. With Caring Thoughts Of Sympathy. Scott Hartman February 19, 2017 Mrs Varga, Tonya, Paul (and extended families): We are so very sorry to hear of Mr Vargas passing. So many memories growing up as family friends. Visiting, fishing at Kelleys Island, even my parents leaving me behind at the Varga house when I was no more than 5 years old. Every visit started and ended in laughter. I hope that remembering his humor will help ease the loss to your family. A life long friend of my parents - Mr Varga will be missed by all who knew him. May he rest in peace and keep all in heaven laughing! Sincerely, Scott, Julie, Jeremy and Elise Hartman Nashua, NH Pat Barfay February 19, 2017 My sympathy to all.  I remember Paul being in our youth group at the First Hungarian Reformed Church on Buckeye Road and East Boulevard. Brian Smith Sent Flowers Send Flowers February 18, 2017 Tonya, so sorry for your loss, my prayers and thoughts are with you and your family. Kathy Lang Kristee Haas February 18, 2017 Tonya I am so sorry for your loss. Thinking of you and your family! John Forro February 18, 2017 From 1st grade to present he has been my best friend, we lived thru great times together with each other and our families.Will miss you Paul. Showing 1 - 15 of 15 results Make a Donation in PAUL VARGA's name Memorial Events for PAUL VARGA Feb 20 Calling hours 3:00 p.m. - 8:00 p.m. At Funeral Home Send Flowers Feb 21 Funeral service 10:00 a.m. First Hungarian Reformed Church 14530 Alexander Rd, Walton Hills, OH Send Flowers How to support PAUL's loved ones Attending a Funeral: What to Know You have funeral questions, we have answers. Read more Should I Send Sympathy Flowers? What kind of arrangement is appropriate, where should you send it, and when should you send an alternative? Read more What Should I Write in a Sympathy Card? We'll help you find the right words to comfort your family member or loved one during this difficult time. Read more Poems of Mourning and Comfort The best poems for funerals, memorial services., and cards. Read more View All Resources to help you cope with loss How to Cope With Grief Information and advice to help you cope with the death of someone important to you. Read more Estate Settlement Guide If you’re in charge of handling the affairs for a recently deceased loved one, this guide offers a helpful checklist. Read more How to Write an Obituary Need help writing an obituary? Here's a step-by-step guide... Read more Obituaries, grief & privacy: Legacy’s news editor on NPR podcast Legacy's Linnea Crowther discusses how families talk about causes of death in the obituaries they write. Read more View All Ways to honor PAUL VARGA's life and legacy Obituary Examples You may find these well-written obituary examples helpful as you write about your own family. Read more How to Write an Obituary Need help writing an obituary? Here's a step-by-step guide... Read more Obituary Templates – Customizable Examples and Samples These free blank templates make writing an obituary faster and easier. Read more How Do I Write a Eulogy? Some basic help and starters when you have to write a tribute to someone you love. Read more View All Recent deaths in the news Gilson Lavis (1951–2025), drummer for Squeeze Read more Charles Coste (1924–2025), oldest living Olympic champion Read more Marshawn Kneeland (2001–2025), Dallas Cowboys defensive end Read more Mary Ann Wilson (1938–2025), host of Sit and Be Fit on PBS Read more View All More ways to support the family Visit the Sympathy Shop Show your sympathy by sending flowers. Send Your Arrangement Plant a tree in memory of PAUL. Choose Your Tree Dedicate a star in PAUL's name. Name a Star Donate to charity in honor of PAUL. Make a Donation",
    "Paul Varga | How Leaders Lead Paul Varga Brown-Forman, Former Chairman and CEO EPISODE 83 Steward Your Brand and Your People Today’s guest is Paul Varga, the former Chairman and CEO of Brown-Forman, the largest distilling company in the world with brands like Jack Daniels and Woodford Reserve. They have a saying at Brown-Forman, “Build Forever.” The company started in 1890, and the way Paul sees it, it was his responsibility to steward two key parts of the business. He wanted to continue to build their iconic brands, but he also made it a top priority to build their people up as well. Because what a tragedy it would be if the brands grew and their people didn’t grow with it! What you’re about to hear is why Paul cared so deeply about developing his people and ultimately, how that drove success in their business. The great leaders I know build forever, stewarding both their brands and their people. Take your learning further. Get proven leadership advice from these (free!) resources: The How Leaders Lead App : A vast library of 90-second leadership lessons to stay sharp on the go Daily Insight Emails : One small (but powerful!) leadership principle to focus on each day Whichever you choose, you can be sure you’ll get the trusted leadership advice you need to advance your career, develop your team, and grow your business. More from Paul Varga Get daily insights delivered straight to your inbox every morning Short (but powerful) leadership advice from entrepreneurs and CEOs of top companies like JPMorgan Chase, Target, Starbucks and more. Clips Leadership lessons from tennis Paul Varga Brown-Forman, Former Chairman and CEO In marketing, persistence is critical Paul Varga Brown-Forman, Former Chairman and CEO You won’t develop if you’re not challenged Paul Varga Brown-Forman, Former Chairman and CEO Life lessons are just as important as business lessons Paul Varga Brown-Forman, Former Chairman and CEO Your business will only grow as fast as your people do Paul Varga Brown-Forman, Former Chairman and CEO Four questions to assess your impact Paul Varga Brown-Forman, Former Chairman and CEO Your personality is the greatest influence on your culture Paul Varga Brown-Forman, Former Chairman and CEO Explore more topical advice from the world’s top leaders in the How Leaders Lead App The #1 app to help you become a better boss, coach, or leader Transcript David Novak 0:03 Welcome to How leaders lead where every week you get to listen in while I interview some of the very best leaders in the world, I break down the key learning so that by the end of the episode, you'll have something simple that you can apply as you develop into a better leader. That's what this podcast is all about. Today's guest is Paul Varga, the former chairman and CEO of Brown Forman, the largest distilling company in the world with brands like Jack Daniels and Woodford Reserve, they have a saying that Brown Forman build forever. The company started in 1890. And the way Paul sees it, it was his responsibility to steward two key parts of the business. He wanted to continue to build their iconic brands, but he also made it a top priority to build their people up as well. Because what a tragedy would be, if the brands grew and the people didn't grow with it. What you're about to hear is why Paul cares so deeply about developing his people, and ultimately, how that drove the success in their business. The great leaders I know build forever stewarding both their brands and their people. There's a lot for us to learn in this episode. So let's get right to it. Here's my conversation with my good friend and soon to be yours, Paul Varga. You know, Paul, I always like to start out at the beginning. Can you tell us a little bit about your upbringing? Paul Varga 1:26 Well, sure, very interesting to what I do today, I grew up in Louisville, Kentucky, which is where the headquarters of Brown Forman is, and I grew up the son of a physician in a large Catholic family, which was pretty common in Louisville, Kentucky, big Catholic community here, three brothers, two sisters, and all close in age. So it created the environment, as you can imagine of competitiveness, we are all driven and the family you grow up in the activities you pursue, we were all athletic kids. And my mom and dad were having six of us. At some point, I'm sure they said Enough of this trying to get six kids to all these different activities. So my dad and some of his doctor buddies invested in the Louisville tennis club. And then what they went and did was bought a bunch of tennis rackets and said, you all play this. And so as a result of that, frankly, we all concentrated in tennis, and became pretty accomplished tennis family over the years and, you know, knocking around with each other competing, and, you know, raising the standard of performance. And there's no doubt that the size of my family, the proximity, the way we were raised, the sport we played, definitely imparted a lot of who I became. David Novak 2:33 Now, I know, you went on to the University of Kentucky and you played tennis? Unknown Speaker 2:37 I did. Yeah. You know, David Novak 2:38 what's the big life lesson you learn from playing tennis itself. Paul Varga 2:42 I didn't know it at the time. And as I've thought back about it, particularly as it relates to success in business, I mean, there are so many lessons from from athletics generally. But also, in this case, it was individual sports, tennis being much more an individual sport than a team sport, when you grow up playing. And so there's this sense of accountability, that comes for the mistakes you make. I mean, you couldn't turn to somebody and say, Hey, you should have passed me the ball or something like that. I mean, it was your account, if somebody beat the tar out of you, it was on you. And so I always felt like that gave people who came from that particular sport, a sense of accountability, I'll tell you the other thing that I didn't realize until much later, because of the nature of I think this is true of all athletics, but it was particularly true of the tennis experience that had you're making during the course of a match so many individual decisions. And then by the time you get through 1015 years of competition, and you walk into a corporate environment, and people are taking a lot longer to make decisions, the first thing I had to learn was patience. I mean, I was geared you know, I was geared to be competitive, you made 100 decisions a minute, you know, where to hit the ball, where to run all these kinds of things. And you'd get in and you'd look around and see people talk and they said, well, we'll get to that tomorrow. And it just felt like it was so slow. And I had you know, like a lot of kids who would have been growing up and being very competitive, I had a hot temper, I had all those things. And so all of the positive things that gave me you know, under particularly under stress and environment, it can cause negative things, you have to kind of tame it. You have to be very competitive, but also tame that competitive spirit of time and then throttle down your enthusiasm for you know, in terms of the pacing, and there were all kinds of things that I learned through that experience. David Novak 4:27 Now, I know you went on to get your MBA at Purdue after graduating from Kentucky and you actually started out as an intern at Brown Forman, tell us how that happened. Paul Varga 4:38 Yeah, in the mid 80s. I was up and looked at the Career board one day, near the end of my first year. It was a two year program, getting my master's and there was a sort of a prospect for being an intern down here at Brown Forman I came down. It was really funny story. My dad, who was a prominent physician in town, everybody was always coming up to my brothers and sisters and saying how much they I appreciated my dad because he, they typically were a patient. And I came down here and I had had a much older grade uncle who had worked here for years who had passed away. And I wasn't very close to him. So everybody was talking to me. And I'd been away at school for a year and saying how much they appreciated my dad, and how much how sad they were that he passed away. And, of course, I was like, Mom didn't tell me. They were actually talking about another man named Margo. But I will tell you, it was very interesting. It opened up the door, the fact that a great uncle had worked here generations before, and had that name recognition opened up the door to an internship for me. And so I came down here and work that summer and then took the job. When I finished up my second year, a year later, David Novak 5:45 you go from a summer intern to becoming CEO of the largest distillery company in the world at 39. Yeah, how were you able to move up the corporate ladder so fast? Paul Varga 5:56 I'll tell you what happened. I was willing to go do the early work to learn I felt it because there were I had offers coming out of business school that were probably in a short term basis, look preferable training development programs that very nice companies. And I liked the idea of being able to go up, but I thought I could go up fast here. I mean, that was an ambition. But I knew I would need to go learn the business. So I traveled around and went live in Chicago and LA and then moved to Nashville. And the move to Nashville was a move from the sales function into the marketing. So I was learning another function. My undergraduate study and masters had also included finance. So I was very curious about how the money got made, how that money got spent. So I felt I was getting a really well rounded experience early on. And then that opportunity in Tennessee was to work on Jack Daniels, which is our most important brand. And is I mean, such an incredible learning experience to go play any kind of stewardship role in that. And because of that, it gave me exposure to the Chairman and CEO and president of the company who frequently came and spent time with Jack Daniels because of its importance. So that almost happenstance created the opportunity for me to present to them be around them. And a few years later, they asked me to actually come do something pretty unconventional, which was to be their chief of staff. And the chief of staff at Brown Forman back in those days was sort of a ringside seat to how the company got run, and you did a lot of staff work, but you wrote position papers, you did a lot of communicating. And for the most part, I didn't know what at the time, you got an opportunity to see if you were gonna like the kind of job I ended up getting. And I know for a lot of people to see that kind of breadth and intensity of pressure, etc. It's not for everybody. And so I didn't know at that time that I would even have an opportunity to take on that kind of role. But that was a very important career move for me. And then I later went back into the organization to sort of help as Les Brown and Bill straight, who were the leaders at the time to really globalize the company, something you know very well, and would follow that were several years of really setting up the infrastructure for brown Foreman's globalization on a brand front on a distribution front, learning the ropes, seeing how to staff knowing how to sell all of those kinds of things. And then, several years later, after taking on the role of the Chief Marketing Officer, it did surprise me at the young age that I was that they tapped me on the shoulder and said, We, at the time, Beale Street was turning 65. And so he was the head of our beverage operations, they asked me to run that while I was the remain CEO of the company. David Novak 8:35 Now I know that you're a well known and famous marketing person, and you're really known for being a great marketer. And I saw your eyes light up when you even mentioned Jack Daniels. And it's not six o'clock, and it is somewhere, as you would say. So tell me, how do you build iconic brand like Jack Daniels? I mean, I know you can't do that one minute. But what was the big key to that brand taken off? Paul Varga 8:59 I'll tell you what it had already. Of course, by the time I had the opportunity to work on it. It was already so prominent in popular culture, and had been so well marketed by the people who had been the stewards of it prior to my arrival for sure. So I was a student at first. And then the other aspect with this popular culture piece was Jack Daniels had taken hold of the hearts and minds of consumers, particularly in America. And as Americana was piped around the world, whether it was through movies, music, and concerts, or books, or authors, etc. Oftentimes, an expression of masculine independence or America was expressed through Jack Daniels. So in many instances, I remember the early days of going out into the emerging markets and we had no distribution, but everybody knew what Jack Daniels was. And so for us, a lot of it was how do we get this thing available in a scalable way so that we can then also educate them more about the book And so that would say a lot of our job in those days was to make something that we knew was already attractive and desired around the world and people were aware of it was a hell of a head start, then to go in and then supplement it with the real story about its roots and origins. And so there's a whole bunch of us that went out and undertook that work. David Novak 10:19 Yeah, you traveled all around the world. What was the funniest marketing story you could give us about Jack Daniels the experience? Paul Varga 10:25 Oh, well, I'll never forget. I was in London. And we were over there for Wimbledon. We actually staying at the house that Steffi Graf was staying and at the time, she won the Wimbledon Championships, there was a buddy of mine from college who was working as one of the agents for her. So I said, Come on over. So we went over. And we went out that night, you know, after we got in and watch some of the tennis and so we were out. And there was this huge line outside this bar. And I had a Jack Daniels business card, and it looked like about an hour and a half wait now walked up to you huge bouncer standing there, and I walked up, and I handed the guy the business card. And I had said, Hey, any chance we'd be able to get in here and something shorter than about an hour or two. And he went and grabbed the owner, the owner came out and he said, I hear you are Jack Daniels. No, I wish I was close enough and that I work for the company. And you wouldn't have believed I mean, it just the door it opened. And so that was the reality to me of the brands fame. And so one of the important lessons about that is that if you author something that's iconic like that, and I know you've had experience with this as well, there's only you guide it, you don't try necessarily to overhaul or champion your your your part passenger, because in the instance of Jack Daniels, the ",
    "Paul Varga and Kirsten Quinn's Wedding Website Loading Loading Loading Loading Loading Loading Paul & Kirsten Home Schedule RSVP Hotel Registry Wedding Party Gallery Local Activities FAQs Kirsten Quinn and Paul Varga # VowsWithTheVargas August 2, 2025 Kutztown, PA RSVP Our Story Like the stereotypical millennials that they are, Kirsten and Paul met on Hinge (a dating app).  Kirsten had only spent 3 days on the app, while Paul had largely lost faith in humanity by this point.  Neither person had very high expectations from a Hinge date, but the conversation flowed so easily and comfortably that they were pleasantly surprised and continued seeing each other.\n\nFast forwarding a few months, on March 8, 2020, they decided to make their relationship official.  What an exciting time!  They were ready to take on the world.  Within four days of this, the world decided it was not ready to be taken on and opted instead to unleash a pandemic and promptly close down for an undisclosed amount of time.  The blossoming couple quickly realized they would soon find out just how well they could handle doing absolutely nothing together.  And it went great!  The burgeoning couple discovered, in fact, that doing nothing was one of their favorite hobbies.\n\nA few years later, they moved into an apartment in Phoenixville together.  They travelled as much as they could while simultaneously saving for a house.  Finally, with the wealth of real estate knowledge that they picked up from being an engineer and a nurse, they secured a house in Collegeville, PA, just months after housing prices reached all time highs.  Expertly done!  They turned this house into a home (where the heart is), and through all of the ups and downs over their 5+ years together, they have continued to love, support and prioritize each other.  Until it was finally time to pop the question...\n\nOn July 20, 1969, perhaps one of the most memorable days for the human race, Neil Armstrong asserted, \"That's one small step for man, one giant leap for mankind.\"  \n\nOn July 20, 2024, with a comparable amount of charisma and only slightly less significance to humanity, Paul uttered the words \"Will you marry me?\" and Kirsten said \"Yes.\" For all the days along the way About Zola Guest FAQs Order status support@zola.com 1 (408) 657-ZOLA Start your wedding website © 2025 Zola, Inc. All rights reserved. Accessibility / Privacy / Terms"
  ],
  "links": [
    "https://frederickcountymd.gov/directory.aspx?EID=1898",
    "https://www.calmstorm.vc/team/paul-varga",
    "https://www.linkedin.com/in/paul-varga-6ab6b646",
    "https://stpetersbytheshore.org/news/in-memory-of-fr-paul-varga-ofm-conv",
    "https://www.instagram.com/paulanthonyvarga/",
    "https://gatton.uky.edu/people/paul-varga",
    "https://www.brown-forman.com/article/brown-forman-announces-leadership-succession-plan-may-29-2018",
    "https://obits.cleveland.com/us/obituaries/cleveland/name/paul-varga-obituary?id=17929187",
    "https://howleaderslead.com/leaders/59/Paul-Varga",
    "https://www.zola.com/wedding/paulandkirsten2025"
  ]
}